[
  {
    "id": "adobo-black-beans-with-shredded-lettuce-lime-cashew-crema-avocado-salsa-macha",
    "title": "Adobo Black Bean Tostadas With Shredded Lettuce, Lime Cashew Crema, Avocado & Salsa Macha",
    "source_url": "https://planthood.co.uk/products/adobo-black-beans-with-shredded-lettuce-lime-cashew-crema-avocado-salsa-macha",
    "week_label": null,
    "weeks": [
      "Nov 10, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Adobo Black Bean Tostadas With Shredded Lettuce, Lime Cashew Crema, Avocado & Salsa MachaOur smokey, slow-cooked black beans are layered with a multitude of complex flavours like cumin, paprika and ancho chillies, served on crispy corn tostadas and topped with crisp shredded lettuce and creamy avocado. Finished with a zingy lime cashew crema and our house made salsa macha featuring crushed peanuts and three types of Mexican chillies.Prep time2Total time10Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Take out a saucepan and preheat your oven to 200°C / 180°C fan.STEP 2Traditionally tostadas are shallow fried in oil for 30 seconds on each side, which you can do if you want them to turn really crispy. However for our healthier, oil-free version, simply pop thetacosonto a baking tray with space in between them and bake for 8 minutes or until crispy, flipping half way.STEP 3Drain theblackbeansand empty into your saucepan along with thesmoky adobo sauce, place over a medium heat and warm through, stirring occasionally, until piping hot, around 5 minutes. Add a splash of water if it starts to stick at the bottom. Roughly mash around half of the beans with a fork and set aside.STEP 4Finely shred thebabygemby cutting horizontally across the head. De-stone theavocadoand cut into thin slices flat side down. If you're feeling fancy you could fan the avocado for a more elevated final presentation. Using the palm of your hand, carefully push the avocado down and away from yourself to open it up like a fan without the slices breaking. Cut thelimeinto wedges.STEP 5Lay everything out on your table and then start building your tostadas. Start with a layer ofblackbeans, then shreddedlettuce, dress the lettuce with a drizzle ofcashewcrema, top with some slices ofavocadoand a final drizzle ofsalsamacha. Finish with a squeeze of freshlimejuice, and enjoy!What’s in your boxSmoky Adobo SauceBlack BeansSalsa MachaFreshly Baked TacosCashew CremaBaby Gem LettuceAvocadoLimeNutritional infoAll nutritional values are based on a per person scale.Calories753kcalTotal fat48.4gSaturated fat8.3gSalt1.5gTotal carbohydrate64.9gTotal sugar13gFibre19.4gProtein21.3gIngredients / AllergensBlack beans, red onion, garlic, cumin, smoked sweet paprika, ground coriander, cinnamon, clove, oregano, tomato purée, raw organic agave nectar, chipotle paste, balsamic vinegar (sulphites), water, sea salt, cashews (nuts), organic cultured soy yoghurt (soy), fresh lemon juice, garlic powder, extra virgin olive oil, rapeseed oil, ancho chiles, guajillo chiles, roastedpeanuts,sesameseeds, apple cider vinegar (sulphites), corn tortillas (yellow corn flour), baby gem lettuce, lime, avocadoFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 753.0,
      "protein_g": 21.3,
      "fat_g": 48.4,
      "carbs_g": 64.9,
      "fibre_g": 19.4,
      "salt_g": 1.5
    }
  },
  {
    "id": "afghan-aubergine-borani-banjan-with-saucy-spiced-lentils-garlic-yoghurt-fresh-mint-pillowy-flatbreads",
    "title": "Afghan Aubergine (Borani Banjan) With Saucy Spiced Lentils, Garlic Yoghurt, Fresh Mint & Pillowy Flatbreads",
    "source_url": "https://planthood.co.uk/products/afghan-aubergine-borani-banjan-with-saucy-spiced-lentils-garlic-yoghurt-fresh-mint-pillowy-flatbreads",
    "week_label": null,
    "weeks": [
      "Nov 17, 2025"
    ],
    "category": "Feast",
    "ingredients": [],
    "method": "Afghan Aubergine (Borani Banjan) With Saucy Spiced Lentils, Garlic Yoghurt, Fresh Mint & Pillowy FlatbreadsThis dish is inspired by the Afghan recipe, borani banjan, which made with aubergine and yogurt. Crispy roasted aubergine sit over a rich tomato sauce infused with garlic and spices. Although not traditional, we've added lentils to the sauce for extra protein, iron and fibre for gut health. It's all finished with garlic yoghurt, fresh mint and served with our pillowy soft garlic and herb flatbreads for mopping everything up. It's a delicious dish to put in the centre of the table and enjoy feasting style.Prep time1Total time20Cooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories474kcalTotal fat6.4gSaturated fat1.3gSalt1.4gTotal carbohydrate79.2gTotal sugar17.5gFibre16.4gProtein20.2gIngredients / AllergensOrganic black lentils, aubergine, tomato, red onion, garlic, balsamic vinegar, gluten free low sodiumsoysauce, paprika, cumin, coriander, fennel, chilli, raw organic agave nectar, cinnamon, allspice, tomato puree, sea salt, organic cultured soy yoghurt (soybeans, water, selected live cultures (Bifidus, Acidophilus), lemon, mint, garlic & herb flatbread (wheat flour (gluten), salt, yeast, vegetable oil, garlic, mixed herbs)For allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 474.0,
      "protein_g": 20.2,
      "fat_g": 6.4,
      "carbs_g": 79.2,
      "fibre_g": 16.4,
      "salt_g": 1.4
    }
  },
  {
    "id": "aromatic-aubergine-sambal-over-whipped-tamarind-tofu-with-crispy-lentils-toasted-peanuts-coriander",
    "title": "Sticky Aubergine Sambal Over Tamarind Whipped Tofu With Crispy Lentils, Toasted Peanuts & Coriander",
    "source_url": "https://planthood.co.uk/products/aromatic-aubergine-sambal-over-whipped-tamarind-tofu-with-crispy-lentils-toasted-peanuts-coriander",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Sticky Aubergine Sambal Over Tamarind Whipped Tofu With Crispy Lentils, Toasted Peanuts & CorianderPrep timeTotal timeCooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.CaloriesTotal fatSaturated fatSaltTotal carbohydrateTotal sugarFibreProteinIngredients / Allergens",
    "nutrition": {}
  },
  {
    "id": "aromatic-thai-green-curry-soup-with-beluga-lentils-tender-aubergine-sweet-potato-basil-lime",
    "title": "Aromatic Thai Green Curry Soup With Beluga Lentils, Tender Aubergine, Sweet Potato, Basil & Lime",
    "source_url": "https://planthood.co.uk/products/aromatic-thai-green-curry-soup-with-beluga-lentils-tender-aubergine-sweet-potato-basil-lime",
    "week_label": null,
    "weeks": [
      "Oct 20, 2025",
      "Dec 08, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Aromatic Thai Green Curry Soup With Beluga Lentils, Tender Aubergine, Sweet Potato, Basil & LimeOur super green Thai curry soup is infused with punchy aromatic flavours like kaffir lime leaves, lemongrass, galangal and garlic with a few subtle spices, all simmered in decadent coconut milk and finished with fresh basil. At home you'll fill it with roasted aubergine and sweet potato which are both full of vitamins B, C and antioxidants. We've also swapped rice for tender beluga lentils which is great for your gut and is high in protein.Prep timeTotal timeCooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Preheat your oven to 220°C / 200°C fan and take out a large roasting tray, and a large saucepan.STEP 2Dice thesweet potatoandaubergineinto 1.5cm cubes. Add the sweet potato to one side of your roasting tray and the aubergine to the other. Drizzle generously with olive oil, season with salt and pepper and roast until tender, around 20-30 minutes.STEP 3Once there's 5 minutes left on the vegetables, add thegreen curry soupto your saucepan. Bring to a gentle simmer and cook for a further 2-3 minutes or until piping hot.Meanwhile drain and rinse the lentils well. Roll up thebasilleaves with your hands and finely slice them. Set aside a quarter of the basil leaves for a garnish.Add the drainedlentilsand the remaining three quarters ofbasilto the soup and cook for a further 2 minutes. Remove from the heat, squeeze in half of the lime and season to taste with salt.STEP 4To serve, divide thethai green curry soupandlentilsbetween serving bowls, arrange thesweetpotatoandauberginearound the bowl and garnish with the remainingbasilleaves. Squeeze over the remaininglimeand enjoy!What’s in your boxGreen Curry SoupSweet PotatoBasilBlack LentilsAubergineLimeNutritional infoAll nutritional values are based on a per person scale.Calories769kcalTotal fat37.3gSaturated fat31.8gSalt1gTotal carbohydrate102.1gTotal sugar23.1gFibre24.7gProtein18.7gIngredients / AllergensSpring onion, garlic, ginger, green chilli, lemongrass, fresh coriander, ground cumin, ground turmeric, ground coriander, coconut milk, coconut cream, spinach, raw organic agave nectar, lime leaves, sea salt, sweet potato, beluga lentils, lime, aubergine, fresh basilFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 769.0,
      "protein_g": 18.7,
      "fat_g": 37.3,
      "carbs_g": 102.1,
      "fibre_g": 24.7,
      "salt_g": 1.0
    }
  },
  {
    "id": "aubergine-parm-sandwich-with-tomato-marinara-vegan-pesto-on-soft-vegan-brioche",
    "title": "Aubergine Parmigiana Sandwich With Pesto Mayo & Rich Tomato Reduction On Soft Vegan Brioche",
    "source_url": "https://planthood.co.uk/products/aubergine-parm-sandwich-with-tomato-marinara-vegan-pesto-on-soft-vegan-brioche",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Aubergine Parmigiana Sandwich With Pesto Mayo & Rich Tomato Reduction On Soft Vegan BriocheOne of the most delicious flavour combinations ever invented - in a sandwich. Tender slices of aubergine coated in crispy golden panko breadcrumbs, slathered with a rich tomato and basil reduction and tangy vegan pesto mayo, all inside a soft vegan brioche. Served alongside crispy baby new potatoes.Prep timeTotal timeCooking Mode:\nCooking instructionsOne of the most delicious flavour combinations ever invented - in a sandwich. Tender slices of aubergine coated in crispy golden panko breadcrumbs, slathered with a rich tomato and basil reduction and tangy vegan pesto mayo, all inside a soft vegan brioche. Served alongside crispy baby new potatoes.NutritionCalories 774kcal; Protein 14.26g; Fat 34g; Saturated Fat 4.6g; Total Carbs 108g; Fibre 17.26g; Salt 0.5gIngredientsAubergine, garlic, tomatoes, basil, salt, pepper, balsamic vinegar, tomato puree,soymilk, lemon juice, agave, vegetable oil (soy),basil,white flour (wheat), panko breadcrumbs (wheat),vegan brioche (fortifiedwheatflour (wheatflour, calcium carbonate, iron, niacin, thiamine, niacin),soyamilk, water, rapeseed oil, cane sugar, yeast, salt, flour improver) baby new potatoesAllergensSoy, wheatPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories774kcalTotal fat34gSaturated fat4.6gSalt0.5gTotal carbohydrate108gTotal sugarFibre17.26gProtein14.26gIngredients / AllergensAubergine, garlic, tomatoes, basil, salt, pepper, balsamic vinegar, tomato puree,soymilk, lemon juice, agave, vegetable oil (soy),basil, white flour (wheat), panko breadcrumbs (wheat), vegan brioche (fortifiedwheatflour (wheatflour, calcium carbonate, iron, niacin, thiamine, niacin),soyamilk, water, rapeseed oil, cane sugar, yeast, salt, flour improver) baby new potatoesAllergensSoy, wheatPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 774.0,
      "protein_g": 14.26,
      "fat_g": 34.0,
      "carbs_g": 108.0,
      "fibre_g": 17.26,
      "salt_g": 0.5
    }
  },
  {
    "id": "aubergine-unagi-donburi-bowl-with-edamame-sweet-cucumber-pickle-spring-onion-sesame-seeds",
    "title": "Aubergine 'Unagi' Donburi Bowl With Edamame, Sweet Cucumber Pickle, Spring Onion & Sesame Seeds",
    "source_url": "https://planthood.co.uk/products/aubergine-unagi-donburi-bowl-with-edamame-sweet-cucumber-pickle-spring-onion-sesame-seeds",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Aubergine 'Unagi' Donburi Bowl With Edamame, Sweet Cucumber Pickle, Spring Onion & Sesame SeedsPrep timeTotal timeCooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.CaloriesTotal fatSaturated fatSaltTotal carbohydrateTotal sugarFibreProteinIngredients / Allergens",
    "nutrition": {}
  },
  {
    "id": "autumnal-gratin-with-rich-lentil-ragu-topped-with-potato-beetroot-sweet-potato-creamy-miso-bechamel",
    "title": "Rich Ragu & Roasted Roots Gratin, Topped With Crispy Potato, Beetroot, Sweet Potato & Creamy Miso Bechamel",
    "source_url": "https://planthood.co.uk/products/autumnal-gratin-with-rich-lentil-ragu-topped-with-potato-beetroot-sweet-potato-creamy-miso-bechamel",
    "week_label": null,
    "weeks": [
      "Dec 01, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Rich Ragu & Roasted Roots Gratin, Topped With Crispy Potato, Beetroot, Sweet Potato & Creamy Miso BechamelA rich, hearty, warming dish that's brings together the best of a gratin and a shepherds pie. Featuring a rich lentil ragu, topped with sliced potato, beetroot and sweet potato, and a final layer of creamy miso bechamel. There's minimal prep and it's all roasted in one dish so it's super simple after a long day. When it comes out of the oven the ragu is bubbling, the roasted root veg is crispy and the creamy bechamel delivers a heavenly 'cheesy' flavour.. A seriously delicious way to hit your veg, protein, fibre and iron goals.Prep timeTotal timeCooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Preheat your oven to 220°C / 200°C fan. Take out a large casserole dish or an ovenproof dish.STEP 2Scrub thebeetrootto remove any dirt from the skin. Then slice thebeetroot,sweet potato, andpotato, as thinly as possible, around 1.5-2 mm thick. Use a mandoline slicer if you have one. Toss the sliced vegetables in olive oil, salt and pepper in a bowl.STEP 3In your casserole or ovenproof dish, mix together theroots gratin raguand the tin ofblack lentils, including the liquid from the can. Spread evenly to cover the base. Lay the slicedbeetroot,sweet potato, andpotatoon top so they are overlapping and covering the whole dish. We recommend alternating the vegetables as the colours look really beautiful together! For example lay 3 slices of beetroot, then 3 slices of sweet potato and so on.Pour themiso bechamelevenly over the top, then cover with a lid or a sheet of aluminium foil and bake for 20 minutes, until the vegetables are tender. Remove the lid or foil and bake for a further 10 minutes, or until the root vegetables have crispy edges and the bechamel is golden in places.STEP 4To serve, divide thegratinbetween dishes. Finish with a sprinkle of salt and freshly ground black pepper to taste. Enjoy!What’s in your boxRoots Gratin RaguMiso BechamelBlack LentilsBeetrootSweet PotatoPotatoNutritional infoAll nutritional values are based on a per person scale.Calories591kcalTotal fat8.3gSaturated fat1.6gSalt1.8gTotal carbohydrate96.1gTotal sugar30.3gFibre19.2gProtein23.6gIngredients / AllergensMaris piper potato, sweet potato, beetroot, black lentils, onion, carrot,celery, garlic, thyme, rosemary, red wine (sulphites), gluten freesoysauce, balsamic vinegar (sulphites), raw organic agave nectar, marmite (yeast extract (barley, wheat, oats, rye) (gluten), salt, vegetable extract, vitamins (thiamin, riboflavin, niacin, vitamin b12, folic acid), natural flavouring (celery)), sea salt, tomato purée, tomatoes, black pepper, extra virgin olive oil, rapeseed oil,soymilk, nutritional yeast, potato flakes, garlic powder, onion powder, rice vinegar, white miso (soybeans, rice, salt), fresh lemon juiceFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 591.0,
      "protein_g": 23.6,
      "fat_g": 8.3,
      "carbs_g": 96.1,
      "fibre_g": 19.2,
      "salt_g": 1.8
    }
  },
  {
    "id": "bbq-jackfruit-tacos-chipotle-cashew-crema",
    "title": "Jackfruit Carnitas Tacos With Smokey Chipotle Cashew Crema, Pickles & Coriander On Soft Corn Tortillas",
    "source_url": "https://planthood.co.uk/products/bbq-jackfruit-tacos-chipotle-cashew-crema",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Jackfruit Carnitas Tacos With Smokey Chipotle Cashew Crema, Pickles & Coriander On Soft Corn TortillasDeliciously meaty pulled jackfruit marinated in a spice blend of garlic, paprika, cumin, cloves and chipotle, then slowly cooked until charred on the outside and falling apart in the centre. Served on soft corn tortillas with pickled cabbage, carrot and red onion, chipotle cashew crema and fresh coriander.Prep timeTotal timeCooking Mode:\nCooking instructionsDeliciously meaty pulled jackfruit marinated in a spice blend of garlic, paprika, cumin, cloves and chipotle, then slowly cooked until charred on the outside and falling apart in the centre. Served on soft corn tortillas with pickled cabbage, carrot and red onion, chipotle cashew crema and fresh coriander.NutritionCalories 535kcal; Protein 11g; Fat 14.7g; Saturated Fat 2.9g; Total Carbs 98.5g; Fibre 10.6g; Salt 1.5gIngredientsRed onion, garlic, cumin, paprika, ground coriander, cinnnamon, cloves, oregano, tomato puree, maple syrup, chipotle, balsamic vinegar, vegan boullion (celery), water, young green jackfruit, red cabbage, red onion, carrot, cider vinegar, raw natural cane sugar, sea salt, brown mustard seeds,cashews, corianderAllergensNuts, celery, soyPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories535kcalTotal fat14.7gSaturated fat2.9gSalt1.5gTotal carbohydrate98.5gTotal sugarFibre10.6gProtein11gIngredients / AllergensRed onion, garlic, cumin, paprika, ground coriander, cinnnamon, cloves, oregano, tomato puree, maple syrup, chipotle, balsamic vinegar, vegan boullion (celery), water, young green jackfruit, red cabbage, red onion, carrot, cider vinegar, raw natural cane sugar, sea salt, brown mustard seeds,cashews, corianderAllergensNuts, celery, soyPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 535.0,
      "protein_g": 11.0,
      "fat_g": 14.7,
      "carbs_g": 98.5,
      "fibre_g": 10.6,
      "salt_g": 1.5
    }
  },
  {
    "id": "brothy-giant-cous-cous-bowl-with-smokey-tempeh-chorizo-braised-cavolo-nero",
    "title": "Brothy Giant Couscous Bowl With Smokey Tempeh 'Chorizo', Cavolo Nero & Fresh Coriander",
    "source_url": "https://planthood.co.uk/products/brothy-giant-cous-cous-bowl-with-smokey-tempeh-chorizo-braised-cavolo-nero",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Brothy Giant Couscous Bowl With Smokey Tempeh 'Chorizo', Cavolo Nero & Fresh CorianderPrep timeTotal timeCooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.CaloriesTotal fatSaturated fatSaltTotal carbohydrateTotal sugarFibreProteinIngredients / Allergens",
    "nutrition": {}
  },
  {
    "id": "brown-rice-noodles-with-crispy-tofu-julienned-vegetables-black-bean-rayu-chilli-sauce",
    "title": "Tender Rice Noodles With Crispy Tofu, Julienned Vegetables & Black Bean Rayu Chilli Sauce",
    "source_url": "https://planthood.co.uk/products/brown-rice-noodles-with-crispy-tofu-julienned-vegetables-black-bean-rayu-chilli-sauce",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Tender Rice Noodles With Crispy Tofu, Julienned Vegetables & Black Bean Rayu Chilli SauceOur umami-rich black bean rayu chilli dressing is the star of the show in this delicious bowl of noodle heaven. It's filled with protein-rich tofu, crunchy courgette and carrot, all freshened up with a scattering of mint.Prep timeTotal timeCooking Mode:\nCooking instructionsOur umami-rich black bean rayu chilli dressing is the star of the show in this delicious bowl of noodle heaven. It's filled with protein-rich tofu, crunchy courgette and carrot, all freshened up with a scattering of mint.NutritionCalories 578kcal; Protein 21.4g; Fat 22.3g; Saturated Fat 3.8g; Total Carbs 80.8g; Fibre 10.7g; Salt 0.75gIngredientsBrown rice noodles (brown rice, water, salt), tofu (soy), mint, courgette, carrot, fermented black beans, red chillies, vegetable oil,sesameoil, garlic,sesameseeds,soysauce, raw natural cane sugar, cinnamon, star aniseAllergensSoy, sesamePlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories578kcalTotal fat22.3gSaturated fat3.8gSalt0.75gTotal carbohydrate80.8gTotal sugarFibre10.7gProtein21.4gIngredients / AllergensBrown rice noodles (brown rice, water, salt), tofu (soy), mint, courgette, carrot, fermented black beans, red chillies, vegetable oil,sesameoil, garlic,sesameseeds,soysauce, raw natural cane sugar, cinnamon, star aniseAllergensSoy, sesamePlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 578.0,
      "protein_g": 21.4,
      "fat_g": 22.3,
      "carbs_g": 80.8,
      "fibre_g": 10.7,
      "salt_g": 0.75
    }
  },
  {
    "id": "bun-chay-noodle-salad",
    "title": "Vietnamese Bún Chay Noodle Salad With Walnut Miso & Mushrooms, Pickled Mooli & Carrot & Fresh Herbs",
    "source_url": "https://planthood.co.uk/products/bun-chay-noodle-salad",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Vietnamese Bún Chay Noodle Salad With Walnut Miso & Mushrooms, Pickled Mooli & Carrot & Fresh HerbsA light and vibrant Vietnamese vermicelli noodle salad with crispy miso marinated mushrooms and walnuts, tart pickled carrot and mooli and toasted peanuts. Freshened up with mint and coriander, and a zingy lime dressing.Prep timeTotal timeCooking Mode:\nCooking instructionsA light and vibrant Vietnamese vermicelli noodle salad with crispy miso marinated mushrooms and walnuts, tart pickled carrot and mooli and toasted peanuts. Freshened up with mint and coriander, and a zingy lime dressing.NutritionCalories 602kcal; Protein 25.1g; Fat 21.1g; Saturated Fat 13g; Total Carbs 78.6g; Fibre 10.3g; Salt 1.5gIngredientsVermicelli noodles, carrot, daikon, rice vinegar, water, mint, coriander, ginger, water,soysauce, lime,peanutbutter, maple syrup,peanuts, tofu (soy),walnuts, mushroom, lemongrass, garlicAllergensNuts, peanuts, sesame, soyPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories602kcalTotal fat21.1gSaturated fat13gSalt1.5gTotal carbohydrate78.6gTotal sugarFibre10.3gProtein25.1gIngredients / AllergensVermicelli noodles, carrot, daikon, rice vinegar, water, mint, coriander, ginger, water,soysauce, lime,peanutbutter, maple syrup,peanuts, tofu (soy),walnuts, mushroom, lemongrass, garlicAllergensNuts, peanuts, sesame, soyPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 602.0,
      "protein_g": 25.1,
      "fat_g": 21.1,
      "carbs_g": 78.6,
      "fibre_g": 10.3,
      "salt_g": 1.5
    }
  },
  {
    "id": "butterbean-caponata-with-roasted-peppers-aubergine-salsa-verde-warm-ciabatta-1",
    "title": "Butter Bean Caponata With Roasted Peppers & Aubergine, Salsa Verde & Warm Ciabatta",
    "source_url": "https://planthood.co.uk/products/butterbean-caponata-with-roasted-peppers-aubergine-salsa-verde-warm-ciabatta-1",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Butter Bean Caponata With Roasted Peppers & Aubergine, Salsa Verde & Warm CiabattaThe secret to our caponata sauce is that it's made from hand-chopped fresh tomatoes, which add an amazingly rich, yet fresh tasting sauce. We cook it low and slow with garlic and capers until rich and flavoursome, then stir it through roasted peppers and aubergines and protein-packed butterbeans. Served with a zingy salsa verde and a freshly baked organic toasted ciabatta for dunking in.Prep timeTotal timeCooking Mode:\nCooking instructionsThe secret to our caponata sauce is that it's made from hand-chopped fresh tomatoes, which add an amazingly rich, yet fresh tasting sauce. We cook it low and slow with garlic and capers until rich and flavoursome, then stir it through roasted peppers and aubergines and protein-packed butterbeans. Served with a zingy salsa verde and a freshly baked organic toasted ciabatta for dunking in.NutritionCalories 566kcal; Protein 21g; Fat 16.9g; Saturated Fat 2.1g; Total Carbs 81.9g; Fibre 9.1g; Salt 1.2gIngredientsGarlic, plum tomatoes, tomato puree, salt, pepper, agave, capers, red peppers, aubergine, butterbeans, parsley, olive oil, organic ciabatta (wheat)AllergensFor allergens, please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories566kcalTotal fat16.9gSaturated fat2.1gSalt1.2gTotal carbohydrate81.9gTotal sugarFibre9.1gProtein21gIngredients / AllergensGarlic, plum tomatoes, tomato puree, salt, pepper, agave, capers, red peppers, aubergine, butterbeans, parsley, olive oil, organic ciabatta (wheat)AllergensFor allergens, please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 566.0,
      "protein_g": 21.0,
      "fat_g": 16.9,
      "carbs_g": 81.9,
      "fibre_g": 9.1,
      "salt_g": 1.2
    }
  },
  {
    "id": "butterbean-puttanesca-with-grilled-aubergine-crispy-kale-organic-garlic-ciabatta-fresh-parsley",
    "title": "Butter Bean Puttanesca With Grilled Aubergine, Crispy Kale, Organic Garlic Ciabatta & Fresh Parsley",
    "source_url": "https://planthood.co.uk/products/butterbean-puttanesca-with-grilled-aubergine-crispy-kale-organic-garlic-ciabatta-fresh-parsley",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Butter Bean Puttanesca With Grilled Aubergine, Crispy Kale, Organic Garlic Ciabatta & Fresh ParsleyPrep timeTotal timeCooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.CaloriesTotal fatSaturated fatSaltTotal carbohydrateTotal sugarFibreProteinIngredients / Allergens",
    "nutrition": {}
  },
  {
    "id": "butternut-squash-brothy-beans-with-charred-courgette-crispy-sage-hot-agave-nduja-dressing-toasted-pine-nuts-pumpkin-seeds",
    "title": "Butternut Squash Brothy Beans With Charred Courgette, Crispy Sage, Hot Agave 'Nduja' Dressing, Toasted Pine Nuts & Pumpkin Seeds",
    "source_url": "https://planthood.co.uk/products/butternut-squash-brothy-beans-with-charred-courgette-crispy-sage-hot-agave-nduja-dressing-toasted-pine-nuts-pumpkin-seeds",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Butternut Squash Brothy Beans With Charred Courgette, Crispy Sage, Hot Agave 'Nduja' Dressing, Toasted Pine Nuts & Pumpkin SeedsPrep timeTotal timeCooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.CaloriesTotal fatSaturated fatSaltTotal carbohydrateTotal sugarFibreProteinIngredients / Allergens",
    "nutrition": {}
  },
  {
    "id": "butternut-squash-brothy-beans-with-crispy-sprouts-hot-agave-nduja-oil-toasted-pine-nuts-pumpkin-seeds",
    "title": "Butternut Squash Brothy Beans With Crispy Sprouts & Sage, Hot Agave 'Nduja' Dressing, Toasted Pine Nuts & Pumpkin Seeds",
    "source_url": "https://planthood.co.uk/products/butternut-squash-brothy-beans-with-crispy-sprouts-hot-agave-nduja-oil-toasted-pine-nuts-pumpkin-seeds",
    "week_label": null,
    "weeks": [
      "Oct 27, 2025",
      "Nov 24, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Butternut Squash Brothy Beans With Crispy Sprouts & Sage, Hot Agave 'Nduja' Dressing, Toasted Pine Nuts & Pumpkin SeedsThis might just be the best recipes we've tasted coming out of our test kitchen. The broth is the star of the show, featuring a rich onion, garlic and white wine broth, stirred through with sweet and nutty pureed butternut squash. At home you'll simmer tender butterbeans in the delicious broth, then top with crispy roasted sprouts, a drizzle of hot agave 'nduja' oil to cut through the richness and a sprinkle of toasted pine nuts and pumpkin seeds for a final hit of nutrition and flavour. 20g of fibre and 20g of protein make this dish as nutritious as it is delicious.Prep time5Total time20Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Preheat your oven to 220°C / 200°C fan and take out a large saucepan, a frying pan and a baking tray.STEP 2Trim the bottoms of thebrusselssproutsif needed, then slice them thinly with a sharp knife. Alternatively you can cut them in half but thinly slicing will make them crispier and quicker to cook. Place the sprouts onto your baking tray, toss in a little olive oil and season well with salt and pepper. Roast in the oven until brown and crisp, around 15-20 minutes, turning/tossing halfway.STEP 3Drain thebutterbeansand add to your saucepan along with thesquash broth. Once there is 5 minutes left of cooking time on the sprouts, place the pan over a medium-high heat. Once the sauce is bubbling, reduce to low-medium and cook for 2-3 minutes or until piping hot.STEP 4Place your frying pan over a low-medium heat, then dry fry (without oil) thepumpkin and pine nutsuntil lightly toasted. Remove from the pan and set aside. Add a few tablespoons of olive oil to the pan and place it back over a medium heat. When hot, add thesageleaves without overlapping. The leaves will turn translucent and the oil will stop bubbling around the leaves when they are crisp. Remove and set aside.STEP 5To serve up, divide thebutternut squash brothy beansbetween serving bowls and top with the crispy shreddedsprouts, toastedpumpkin and pine nuts, crispysageand finish with a drizzle ofhot agave nduja. Enjoy!What’s in your boxSquash BrothBrussels SproutsPumpkin & Pine NutsHot Agave NdujaSageButterbeansNutritional infoAll nutritional values are based on a per person scale.Calories550kcalTotal fat22gSaturated fat5.4gSalt2gTotal carbohydrate65.5gTotal sugar13.6gFibre20gProtein21.5gIngredients / AllergensButternut squash, brussels sprouts, butter beans, sage, pumpkin seeds, pinenuts, garlic, onion, white wine (alcohol removed during cooking) (sulphites), rapeseed oil, water, kidney beans, roasted red peppers, sundried tomatoes, hot smoked paprika, sweet smoked paprika, red chilli, red chilli flakes, gochugaru, extra virgin olive oil, white miso(soybeans, rice, salt), raw organic agave nectar, lemon juiceFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 550.0,
      "protein_g": 21.5,
      "fat_g": 22.0,
      "carbs_g": 65.5,
      "fibre_g": 20.0,
      "salt_g": 2.0
    }
  },
  {
    "id": "butternut-squash-gochujang-pasta-with-garlicky-green-kale-sunflower-seed-sprinkle",
    "title": "Butternut Squash & Gochujang Pasta With Garlicky Green Kale & Sunflower Seed Sprinkle",
    "source_url": "https://planthood.co.uk/products/butternut-squash-gochujang-pasta-with-garlicky-green-kale-sunflower-seed-sprinkle",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Butternut Squash & Gochujang Pasta With Garlicky Green Kale & Sunflower Seed SprinklePrep timeTotal timeCooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.CaloriesTotal fatSaturated fatSaltTotal carbohydrateTotal sugarFibreProteinIngredients / Allergens",
    "nutrition": {}
  },
  {
    "id": "butternut-squash-nduja-lasagne-with-tender-lentils-creamy-miso-spinach-bechamel",
    "title": "Smoky Butternut Squash & \"Nduja\" Lasagne With Tender Lentils & Creamy Miso Spinach Bechamel",
    "source_url": "https://planthood.co.uk/products/butternut-squash-nduja-lasagne-with-tender-lentils-creamy-miso-spinach-bechamel",
    "week_label": null,
    "weeks": [
      "Dec 08, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Smoky Butternut Squash & \"Nduja\" Lasagne With Tender Lentils & Creamy Miso Spinach BechamelOur healthy spin on a lasagne, packed with 35g of protein and 30g of fibre. Featuring layers of smoky squash and 'nduja' lentils, and silky miso bechamel with baby spinach. The sauces are all made by our lovely chefs for you, so all you need to do is assemble and whack it in the oven!Prep time5Total time30Cooking Mode:\nCooking instructionsCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Preheat your oven to 200°C / 180°C fan. Take out a saucepan, a mixing bowl and a baking dish around 15x20cm (or double this for a four person box).STEP 2Drain thelentilsand add them to your mixing bowl along with thesquash & nduja filling. Give everything a good mix to combine.STEP 3Place a saucepan over medium heat and add thecreamy miso bechamel. Bring it to a gentle simmer, then add thebaby spinachand cook for about a minute until wilted.STEP 4Build your lasagne in three layers:Spread one-third of thelentils, squash & nduja mixin the base of your dish. Cover withlasagne sheets(about 2½ sheets per layer).Top with one-third of thebaby spinach & miso bechamel, then another third of thelentils, squash & nduja mix.Repeat with morelasagne sheets, another third ofbaby spinach & miso bechamel, and the remaininglentils, squash & nduja mix.Finish with a final layer oflasagne sheetsand the rest of thebaby spinach & miso bechamel.Drizzle with olive oil, season with salt and pepper, then bake for 25–30 minutes, until bubbling and golden. To check doneness, insert a knife into the centre, and if it’s hot through and the pasta is tender, it's ready.STEP 5Place the lasagne in the middle of the table and divide it between serving plates. We like stacking pieces on top of each other to make one bigger slice per person, but you could serve them as they are too. Enjoy!What’s in your boxSquash & Nduja FillingMiso BechamelBaby SpinachLasagne SheetsOrganic Brown LentilsNutritional infoAll nutritional values are based on a per person scale.Calories664kcalTotal fat7gSaturated fat1.4gSalt1.7gTotal carbohydrate119gTotal sugar18.6gFibre29gProtein35.4gIngredients / AllergensButternut squash, water, garlic, tomato purée, smoked sweet paprika, hot smoked paprika, white miso (soybeans, rice, salt), tomatoes, raw organic agave nectar, sea salt, gluten freesoysauce, onion powder, brown lentils, extra virgin olive oil, rapeseed oil, soy milk (soybeans, water), nutritional yeast, potato flakes, garlic powder, rice vinegar, fresh lemon juice, lasagne sheets (gluten), baby spinachFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 664.0,
      "protein_g": 35.4,
      "fat_g": 7.0,
      "carbs_g": 119.0,
      "fibre_g": 29.0,
      "salt_g": 1.7
    }
  },
  {
    "id": "butternut-squash-spelt-risotto-with-crispy-sage-smokey-toasted-pine-nuts",
    "title": "Butternut Squash & Spelt Risotto With Crispy Sage & Smoky Toasted Pine Nuts",
    "source_url": "https://planthood.co.uk/products/butternut-squash-spelt-risotto-with-crispy-sage-smokey-toasted-pine-nuts",
    "week_label": null,
    "weeks": [
      "Dec 01, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Butternut Squash & Spelt Risotto With Crispy Sage & Smoky Toasted Pine NutsThis autumnal squash dish is inspired by risotto, but made so much healthier by swapping out the traditional arborio rice for the nutritionally superior spelt. It’s a nutty, chewy grain that works so well with the super creamy miso butternut squash sauce. Finished off with a smoky pine nut drizzle and crispy sage.Prep timeTotal timeCooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Boil your kettle, then take out a large saucepan, small saucepan and frying pan.STEP 2Pour boiling water from your kettle into a large saucepan, salt the water, then place over a medium-high heat. Once the water is bubbling, add thespeltand turn it down to a simmer. Cook until al dente, around 15-20 minutes. Reserve a mug of water for later, then drain the spelt once cooked.STEP 3Once there's 5 minutes left of cooking time on your spelt, heat thebutternutsquashsaucein your other saucepan for around 3-5 minutes or until piping hot. Mix the spelt into the warmed sauce once cooked. If the sauce has reduced and needs loosening a little, and add your reserved cooking water until you have a creamy risotto consistency.STEP 4Heat a few tablespoons of olive oil in your frying pan. When hot, add thesageleaves without overlapping. The leaves will turn translucent and the oil will stop bubbling around the leaves when they are crisp. Turn off the heat and sprinkle in thesmoky pine nut mix.STEP 5To serve, divide therisottointo serving bowls, scatter over thesage,smokypinenutsand drizzle over any remaining smoky sage oil (optional). Season with salt and pepper to taste and enjoy!What’s in your boxButternut Squash SauceSmoky Pine Nut MixCavolo NeroSageSpeltNutritional infoAll nutritional values are based on a per person scale.Calories650kcalsTotal fat16.3gSaturated fat2.8gSalt2.81gTotal carbohydrate106.6gTotal sugarFibre15.8gProtein22.9gIngredients / AllergensOrganic pearled spelt (wheat), butternut squash, garlic, water,  white miso (soy,rice, salt, yeast, koji culture), lemon juice, preserved lemon paste, nutritional yeast, oat milk (water, oats, vitamins (D2, B12, Riboflavin, Folic Acid) (wheat), white wine (sulphites), pinenuts, smoked paprika, sea salt, fresh sageFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 650.0,
      "protein_g": 22.9,
      "fat_g": 16.3,
      "carbs_g": 106.6,
      "fibre_g": 15.8,
      "salt_g": 2.81
    }
  },
  {
    "id": "caesar-pasta-salad-with-smokey-tempeh-cavolo-nero-mangetout-sunflower-seed-pangrattato",
    "title": "High Protein Caesar Pasta Salad With Tempeh Pancetta, Cavolo Nero, Mangetout & Toasted Nuts & Seeds",
    "source_url": "https://planthood.co.uk/products/caesar-pasta-salad-with-smokey-tempeh-cavolo-nero-mangetout-sunflower-seed-pangrattato",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "High Protein Caesar Pasta Salad With Tempeh Pancetta, Cavolo Nero, Mangetout & Toasted Nuts & SeedsPrep timeTotal timeCooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.CaloriesTotal fatSaturated fatSaltTotal carbohydrateTotal sugarFibreProteinIngredients / Allergens",
    "nutrition": {}
  },
  {
    "id": "caprese-salad-with-creamy-vegan-burrata-hazelnut-pesto-rustic-croutons-tender-butterbeans",
    "title": "Caprese Salad With 'Burrata', Hazelnut Pesto, Rustic Croutons & Tender Butterbeans",
    "source_url": "https://planthood.co.uk/products/caprese-salad-with-creamy-vegan-burrata-hazelnut-pesto-rustic-croutons-tender-butterbeans",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Caprese Salad With 'Burrata', Hazelnut Pesto, Rustic Croutons & Tender ButterbeansWe've taken the classic Italian Caprese salad and amped it up with layers of textures and flavours. The star of the show is our new creamy vegan 'burrata' which is unbelievably reminiscent of its dairy counterpart, but made from soy! Served over juicy vine ripened plum tomatoes with golden rustic croutons, sharp red onion, plump butterbeans and finished with a zingy hazelnut pesto -  this is summer in a bowl.Prep timeTotal timeCooking Mode:\nCooking instructionsWe've taken the classic Italian Caprese salad and amped it up with layers of textures and flavours. The star of the show is our new creamy vegan 'burrata' which is unbelievably reminiscent of its dairy counterpart, but made from soy! Served over juicy vine ripened plum tomatoes with golden rustic croutons, sharp red onion, plump butterbeans and finished with a zingy hazelnut pesto -  this is summer in a bowl.NutritionCalories 513kcal; Protein 23.9g; Fat 21.1g; Saturated Fat 19.3g; Total Carbs 60.6g; Fibre 18.6g; Salt 1.12gIngredientsVine plum tomatoes, organic ciabatta (wheat), basil, mint,hazelnuts, extra virgin olive oil, raw agave nectar, balsamic vinegar, red wine vinegar, butterbeans, red onion, vegan burrata (soyamilk, coconut oil, water, salt, xanthan gum, carrageenan, lactic acid, calcium lactate, dextrose, vegan fermentation cultures, vegetable fibres, soya lechitin)AllergensFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories513kcalTotal fat21.1gSaturated fat19.3gSalt1.12gTotal carbohydrate60.6gTotal sugarFibre18.6gProtein23.9gIngredients / AllergensVine plum tomatoes, organic ciabatta (wheat), basil, mint,hazelnuts, extra virgin olive oil, raw agave nectar, balsamic vinegar, red wine vinegar, butterbeans, red onion, vegan burrata (soyamilk, coconut oil, water, salt, xanthan gum, carrageenan, lactic acid, calcium lactate, dextrose, vegan fermentation cultures, vegetable fibres, soya lechitin)AllergensFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 513.0,
      "protein_g": 23.9,
      "fat_g": 21.1,
      "carbs_g": 60.6,
      "fibre_g": 18.6,
      "salt_g": 1.12
    }
  },
  {
    "id": "caramelised-brussels-sprouts-celeriac-with-caper-salsa-verde-toasted-hazelnuts",
    "title": "Crispy Caramelised Brussels Sprouts & Parsnips With Farro, Tangy Caper Salsa Verde & Toasted Hazelnuts",
    "source_url": "https://planthood.co.uk/products/caramelised-brussels-sprouts-celeriac-with-caper-salsa-verde-toasted-hazelnuts",
    "week_label": null,
    "weeks": [
      "Nov 03, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Crispy Caramelised Brussels Sprouts & Parsnips With Farro, Tangy Caper Salsa Verde & Toasted HazelnutsTreat your body to a delicious, protein and fibre-rich medley of caramelised brussels sprouts and parsnips, tossed through nutrient-rich farro grains and smothered in an addictive, tangy caper salsa verde made from rocket, mint and parsley. Finished with a scattering of crushed toasted hazelnuts.Prep time4Total time30Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1This is one of very few recipes that takes a little longer than 15 minutes, but we hope you'll forgive us when you see how easy it is to finish!STEP 2Boil your kettle, pre-heat your oven to 220°C / 200°C fan, then take out a large roasting tray and a saucepan.STEP 3Slice off and discard the bottom end of thebrusselssprouts, then slice vertically in half. Cut theparsnipinto 1.5cm cubes. Add theparsnipsto your roasting tray, toss in a drizzle of olive oil, season well with salt and pepper and roast for 10 minutes. Then add thebrusselssproutstossed in oil, salt and pepper and roast for a further 15-20 minutes or until golden and caramelised. Add thehazelnutsto one side of your baking tray for the final 5 minutes of cooking time.STEP 4Meanwhile, pour boiling water from your kettle into your saucepan and place over a medium heat. Add thefarroand boil for 15 minute or until tender but al dente.STEP 5To serve up, divide thebrusselssprouts,parsnipsandfarrobetween serving plates, scatter over the toastedhazelnuts, then smother everything generously in tangycaper salsa verdedressing. Enjoy!What’s in your boxSalsa VerdeFarroBrussels SproutsHazelnutsParsnipNutritional infoAll nutritional values are based on a per person scale.Calories559kcalTotal fat23.7gSaturated fat2.7gSalt1.05gTotal carbohydrate75.7gTotal sugar17.1gFibre17.6gProtein21.3gIngredients / AllergensParsnips, brussels sprouts, farro (wheat), parsley, mint, rocket, capers, dijonmustard, red wine vinegar, extra virgin olive oil,hazelnutsFor allergens, please see ingredients inbold.Please be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 559.0,
      "protein_g": 21.3,
      "fat_g": 23.7,
      "carbs_g": 75.7,
      "fibre_g": 17.6,
      "salt_g": 1.05
    }
  },
  {
    "id": "carribbean-jackfruit-curry",
    "title": "Comforting Slow-Cooked Caribbean Jackfruit Curry With Coconut Rice & Braised Cavolo Nero",
    "source_url": "https://planthood.co.uk/products/carribbean-jackfruit-curry",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Comforting Slow-Cooked Caribbean Jackfruit Curry With Coconut Rice & Braised Cavolo NeroOur caribbean jackfruit curry is a fiesta of flavours and textures, starring meaty jackfruit, marinated in garlic, ginger, scotch bonnet, allspice and curry powder, all cooked slowly with fresh vegetables and kidney beans until juicy and tender. Served with fluffy coconut rice and vitamin-rich cavolo nero.Prep timeTotal timeCooking Mode:\nCooking instructionsOur caribbean jackfruit curry is a fiesta of flavours and textures, starring meaty jackfruit, marinated in garlic, ginger, scotch bonnet, allspice and curry powder, all cooked slowly with fresh vegetables and kidney beans until juicy and tender. Served with fluffy coconut rice and vitamin-rich cavolo nero.NutritionCalories 605kcal; Protein 23.1g; Fat 6.2g; Saturated Fat 0.4g; Total Carbs 131.2g; Fibre 39.7g; Salt 2gIngredientsOnion, ginger, garlic, turmeric, allspice, curry powder, oregano, scotch bonnet chilli, vegan boullion (celery), water, tomato puree, tamari(soy), tinned tomatoes, carrot, potato, kidney beans, jackfruit, salt, pepper, basmati rice, dessicated coconut, cavolo nneroAllergensCelery,soyPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories605kcalTotal fat6.2gSaturated fat0.4gSalt2gTotal carbohydrate131.2gTotal sugarFibre39.7gProtein23.1gIngredients / AllergensOnion, ginger, garlic, turmeric, allspice, curry powder, oregano, scotch bonnet chilli, vegan boullion (celery), water, tomato puree, tamari(soy), tinned tomatoes, carrot, potato, kidney beans, jackfruit, salt, pepper, basmati rice, dessicated coconut, cavolo nneroAllergensCelery,soyPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 605.0,
      "protein_g": 23.1,
      "fat_g": 6.2,
      "carbs_g": 131.2,
      "fibre_g": 39.7,
      "salt_g": 2.0
    }
  },
  {
    "id": "cauliflower-al-pastor-tacos",
    "title": "Crispy Cauliflower Tacos With Spiced Black Beans, Pickled Cabbage, Whipped Feta Crema, Coriander & Lime",
    "source_url": "https://planthood.co.uk/products/cauliflower-al-pastor-tacos",
    "week_label": null,
    "weeks": [
      "Dec 15, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Crispy Cauliflower Tacos With Spiced Black Beans, Pickled Cabbage, Whipped Feta Crema, Coriander & LimeCrispy cauliflower bites marinated in a smokey guajillo adobo sauce, served in soft corn tortillas with tangy pickled cabbage, fiery jalapeno salsa and smokey chipotle cashew crema.Prep timeTotal timeCooking Mode:\nCooking instructionsCrispy cauliflower bites marinated in a smokey guajillo adobo sauce, served in soft corn tortillas with tangy pickled cabbage, fiery jalapeno salsa and smokey chipotle cashew crema.Health BenefitsCauliflower is a nutritional powerhouse, packed with fibre, antioxidants and choline, which supports metabolism and brain developmentNutritionCalories 552kcal; Protein 16.5g; Fat 18.4g; Saturated Fat 3.9g; Total Carbs 88.4g; Fibre 14.2g; Salt 1.5gIngredientsCauliflower, dried ancho chillies, dried guajillo chillies, red onion, garlic, cumin, oregano, paprika, salt, balsamic vinegar, raw natural cane sugar, jalapenos, coriander, white onion, extra virgin olive oil, red cabbage, cider vinegar (sulphites), salt,cashew nuts, chipotle paste, yellow corn tacos (water, yellow corn flour, sea salt), lime,organic bouillon (sea salt, maltodextrin (from maize), rice flour, onion, carrot, parsnip, yeast extract, rapeseed oil and / or sunflower oil, parsley, turmeric), red wine vinegar, rapeseed oilAllergensFor allergens, see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories552kcalTotal fat18.4gSaturated fat3.9gSalt1.5gTotal carbohydrate88.4gTotal sugarFibre14.2gProtein16.5gIngredients / AllergensCauliflower, dried ancho chillies, dried guajillo chillies, red onion, garlic, cumin, oregano, paprika, salt, balsamic vinegar, raw natural cane sugar, jalapenos, coriander, white onion, extra virgin olive oil, red cabbage, cider vinegar (sulphites), salt,cashew nuts, chipotle paste, yellow corn tacos (water, yellow corn flour, sea salt), lime, organic bouillon (sea salt, maltodextrin (from maize), rice flour, onion, carrot, parsnip, yeast extract, rapeseed oil and / or sunflower oil, parsley, turmeric), red wine vinegar, rapeseed oilAllergensFor allergens, see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 552.0,
      "protein_g": 16.5,
      "fat_g": 18.4,
      "carbs_g": 88.4,
      "fibre_g": 14.2,
      "salt_g": 1.5
    }
  },
  {
    "id": "cauliflower-broccoli-cheese-with-garlic-hazelnut-breadcrumbs-and-lemon-herb-gremolata-dressing",
    "title": "Cauliflower & Broccoli 'Cheese' With Golden Garlic Hazelnut Breadcrumbs and Herby Gremolata Dressing",
    "source_url": "https://planthood.co.uk/products/cauliflower-broccoli-cheese-with-garlic-hazelnut-breadcrumbs-and-lemon-herb-gremolata-dressing",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Cauliflower & Broccoli 'Cheese' With Golden Garlic Hazelnut Breadcrumbs and Herby Gremolata DressingPrep timeTotal timeCooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.CaloriesTotal fatSaturated fatSaltTotal carbohydrateTotal sugarFibreProteinIngredients / Allergens",
    "nutrition": {}
  },
  {
    "id": "charred-aubergine-with-romesco-bulgar-wheat-pilaf-tahini-sauce-herby-caper-gremolata",
    "title": "Charred Aubergine With Romesco, Bulgar Wheat Pilaf, Tahini Sauce & Herby Caper Gremolata",
    "source_url": "https://planthood.co.uk/products/charred-aubergine-with-romesco-bulgar-wheat-pilaf-tahini-sauce-herby-caper-gremolata",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Charred Aubergine With Romesco, Bulgar Wheat Pilaf, Tahini Sauce & Herby Caper GremolataPrep timeTotal timeCooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.CaloriesTotal fatSaturated fatSaltTotal carbohydrateTotal sugarFibreProteinIngredients / Allergens",
    "nutrition": {}
  },
  {
    "id": "charred-courgettes-with-romesco-chickpeas-giant-cous-cous-tahini-sauce-mint-pesto-toasted-almonds",
    "title": "Charred Courgettes With Romesco, Chickpeas, Giant Cous Cous, Tahini Sauce & Mint Pesto",
    "source_url": "https://planthood.co.uk/products/charred-courgettes-with-romesco-chickpeas-giant-cous-cous-tahini-sauce-mint-pesto-toasted-almonds",
    "week_label": null,
    "weeks": [
      "Oct 20, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Charred Courgettes With Romesco, Chickpeas, Giant Cous Cous, Tahini Sauce & Mint PestoRomesco is the star of the show in this dish and the ultimate summer sauce, made with roasted red peppers, almonds and a zingy drizzle of premium sherry vinegar. We're serving it with tender grilled courgettes, fibre and protein packed chickpeas, giant cous cous, then finishing with garlic tahini sauce and a vibrant minty pesto. Delicious!Prep timeTotal timeCooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Boil your kettle, pre-heat your oven to 220°C / 200°C fan and take out a large roasting tray, a small frying pan and a saucepan.STEP 2Place your frying pan over a medium heat and add thealmonds. Dry fry (without oil) for 3-4 minutes or until nicely toasted, tossing occasionally so they don't burn. Set aside and roughly chop or crush the almonds by pressing down on them with a rolling pin or bottom of a heavy pan.STEP 3Cut thecourgettein half lengthways, then into large, diagonal pieces. Drizzle with olive oil and season with salt and pepper, then place on your roasting tray. Cook for 15 minutes or until the courgette is caramelised and starting to char.STEP 4Fill your saucepan with boiling water and place over a high heat. Once it's bubbling, reduce to a simmer and add thegiant cous cous. Cook until tender but al dente, around 6-8 minutes. Drain thechickpeasthen add them to the pan for the final one minute of cooking time.STEP 5Drain thegiant cous cousandchickpeas. Add them to a bowl along with the cookedcourgettesand mix through half of themint pesto.STEP 6To serve, spread theromescosauce(cold) at the bottom of a plate and top with thechickpeas,couscousandcourgettes. Drizzle over the remainingmintpestoandtahinisauce, and sprinkle the toastedalmondsto finish. Enjoy!What’s in your boxRomesco SauceMint PestoGiant CouscousCourgetteTahini DrizzleChickpeasAlmondsNutritional infoAll nutritional values are based on a per person scale.Calories865kcalTotal fat47.2gSaturated fat4.7gSalt1.5gTotal carbohydrate85.9gTotal sugar9.9gFibre21.5gProtein33.8gIngredients / AllergensIngredients / AllergensRed peppers, garlic,almonds, tomato puree, gluten free oat milk, sherry vinegar (sulphites), chilli powder, smoked paprika, extra virgin olive oil, rapeseed oil, organic raw agave nectar, cider vinegar (sulphites), parsley, mint, nutritional yeast, chilli flakes, lemon juice, tahini (sesame), water, sea salt, black pepper, courgette, giant cous cous(gluten), chickpeasFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 865.0,
      "protein_g": 33.8,
      "fat_g": 47.2,
      "carbs_g": 85.9,
      "fibre_g": 21.5,
      "salt_g": 1.5
    }
  },
  {
    "id": "charred-gochujang-glazed-hispi-cabbage-over-lime-tahini-yoghurt-with-lentils-orange-peanut-crumb",
    "title": "Charred Gochujang Glazed Hispi Cabbage Over Lime Tahini Yoghurt With Lentils & Orange Peanut Crumb",
    "source_url": "https://planthood.co.uk/products/charred-gochujang-glazed-hispi-cabbage-over-lime-tahini-yoghurt-with-lentils-orange-peanut-crumb",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Charred Gochujang Glazed Hispi Cabbage Over Lime Tahini Yoghurt With Lentils & Orange Peanut CrumbPrep timeTotal timeCooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.CaloriesTotal fatSaturated fatSaltTotal carbohydrateTotal sugarFibreProteinIngredients / Allergens",
    "nutrition": {}
  },
  {
    "id": "charred-hispi-cabbage-over-chickpeas-in-tahini-yoghurt-with-dukkah-zhoug-dressing",
    "title": "Charred Miso Glazed Hispi Cabbage Over Tahini Yoghurt With Crispy Chickpeas & Superseed Chilli Crunch",
    "source_url": "https://planthood.co.uk/products/charred-hispi-cabbage-over-chickpeas-in-tahini-yoghurt-with-dukkah-zhoug-dressing",
    "week_label": null,
    "weeks": [],
    "category": "Feast",
    "ingredients": [],
    "method": "Charred Miso Glazed Hispi Cabbage Over Tahini Yoghurt With Crispy Chickpeas & Superseed Chilli CrunchDeeply fragrant with smoky, charred edges, our charred hispi cabbage has a deliciously sweet and nutty flavour. It's layered over silky tahini yoghurt with plump chickpeas and finished with a zingy, herby zhoug dressing and a scattering of spiced toasted dukkah for the ultimate plant-based feast.Prep timeTotal timeCooking Mode:\nCooking instructionsDeeply fragrant with smoky, charred edges, our charred hispi cabbage has a deliciously sweet and nutty flavour. It's layered over silky tahini yoghurt with plump chickpeas and finished with a zingy, herby zhoug dressing and a scattering of spiced toasted dukkah for the ultimate plant-based feast.NutritionCalories 616kcal; Protein 24.1g; Fat 37.6g; Saturated Fat 4.5g; Total Carbs 55.2g; Fibre 12.4g; Salt 0.75gIngredientsHispi cabbage, tahini (sesame), lemon juice, chickpeas,almonds,walnuts, sunflower seeds, coriander powder, cumin powder, salt, garlic, jalapenos, red wine vinegar, extra virgin olive oil, water, parsley, coriander, maple syrup, oat yoghurt (water, oats, rapeseed oil, potato starch, potato protein, acids (malic acid, lactic acid), stabiliser (pectin), minerals (calcium carbonate, calcium phosphate, potassium iodide), salt, vitamins (D2 and B12))AllergensFor allergens, see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories616kcalTotal fat37.6gSaturated fat4.5gSalt0.75gTotal carbohydrate55.2gTotal sugarFibre12.4gProtein24.1gIngredients / AllergensHispi cabbage, tahini (sesame), lemon juice, chickpeas,almonds,walnuts, sunflower seeds, coriander powder, cumin powder, salt, garlic, jalapenos, red wine vinegar, extra virgin olive oil, water, parsley, coriander, maple syrup, oat yoghurt (water, oats, rapeseed oil, potato starch, potato protein, acids (malic acid, lactic acid), stabiliser (pectin), minerals (calcium carbonate, calcium phosphate, potassium iodide), salt, vitamins (D2 and B12))AllergensFor allergens, see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 616.0,
      "protein_g": 24.1,
      "fat_g": 37.6,
      "carbs_g": 55.2,
      "fibre_g": 12.4,
      "salt_g": 0.75
    }
  },
  {
    "id": "charred-hispi-cabbage-over-golden-daal-with-organic-soy-yoghurt-tamarind-date-chutney-toasted-almonds-coriander",
    "title": "Charred Hispi Cabbage Over Golden Daal With Organic Soy Yoghurt, Tamarind & Date Chutney, Toasted Almonds & Coriander",
    "source_url": "https://planthood.co.uk/products/charred-hispi-cabbage-over-golden-daal-with-organic-soy-yoghurt-tamarind-date-chutney-toasted-almonds-coriander",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Charred Hispi Cabbage Over Golden Daal With Organic Soy Yoghurt, Tamarind & Date Chutney, Toasted Almonds & CorianderDeeply fragrant with smoky, charred edges, our tamarind glazed hispi cabbage is served over our best-selling creamy golden daal, featuring protein-and-fibre-packed red lentils simmered in coconut milk with turmeric, cardamom, ginger, garlic and garam masala. At home you'll garnish the dish with a delicious combination of cooling organic cultured soy yoghurt, sweet and sour tamarind date chutney and a scattering of toasted flaked almonds, fresh coriander and red chilli. This is a truly decadent, restaurant quality dish that's low in carbs and high in protein (over 30g) and fibre (over 20g).Prep time2Total time15Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Preheat your oven to 220°C / 200°C fan and take out a saucepan and an ovenproof skillet - if you don't have an ovenproof one, take out a frying pan and baking tray instead.STEP 2Place your skillet or frying pan over a high heat. Add theflakedalmondsand dry fry (without oil) until toasted. Set aside and wipe the pan clean with some kitchen towel.STEP 3Meanwhile, cut thehispicabbageinto quarters lengthways and rub in a generous amount of olive oil and season well with salt and pepper. To the same pan that you previously toasted the almonds in, add thehispicabbagecut side down, fry until charred, then flip it over so the other cut side is facing down and repeat. Turn the pan off, flip the cabbage quarters onto their backs so the cut sides are facing up and place into the oven. Roast until they're tender in the centre and charred at the edges, around 15 minutes.STEP 4Add thedaalsauce,redlentilsand 200ml of water to your other saucepan and cook for 10-15 mins until the lentils are soft and tender. Stir occasionally while cooking and add more water as needed if it reduces too much or starts to stick. Season to taste with salt.STEP 5Finely slice thered chilliand roughly chop thecoriander.STEP 6To serve up, divide thedaalbetween serving bowls, top with the charredhispicabbageand drizzle over thedatetamarindchutney,soyyoghurt, somechoppedcorianderandslicedredchilli. Season to taste with salt and pepper and enjoy!Please note: although the dates in the date tamarind chutney are carefully pitted, there is a very small possibility of traces of stonesWhat’s in your boxCoconut Daal SauceHispi CabbageDate Tamarind ChutneyOrganic Soy YoghurtCorianderRed LentilsFlaked AlmondsRed ChilliNutritional infoAll nutritional values are based on a per person scale.Calories665kcalTotal fat24.2gSaturated fat14.9gSalt0.2gTotal carbohydrate77.4gTotal sugar32.4gFibre20.3gProtein31.2gIngredients / AllergensIngredients / AllergensHispi cabbage, red lentils, cardamom, cinnamon, onion, garlic, ginger, green chilli, coriander powder, garam masala (coriander, cinnamon, cloves, ginger, star anise, cumin, chilli, fennel, black pepper, bay leaves, sunflower oil, nutmeg, cardamom), turmeric powder, coconut milk, brownmustardseeds, organic cultured soy yoghurt (soy, water, selected live cultures (Bifidus, Acidophilus)), dates, organic raw agave nectar, water, tamarind, fresh coriander, red chilli, flaked almonds (nuts), sea saltFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 665.0,
      "protein_g": 31.2,
      "fat_g": 24.2,
      "carbs_g": 77.4,
      "fibre_g": 20.3,
      "salt_g": 0.2
    }
  },
  {
    "id": "cheats-aubergine-lentil-parmigiana-with-creamy-miso-bechamel-seasonal-salad-tossed-in-vinaigrette",
    "title": "Cheats Aubergine & Lentil Parmigiana With Creamy Miso Bechamel & Seasonal Salad Tossed In Vinaigrette",
    "source_url": "https://planthood.co.uk/products/cheats-aubergine-lentil-parmigiana-with-creamy-miso-bechamel-seasonal-salad-tossed-in-vinaigrette",
    "week_label": null,
    "weeks": [
      "Oct 27, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Cheats Aubergine & Lentil Parmigiana With Creamy Miso Bechamel & Seasonal Salad Tossed In VinaigretteThis is a super easy way to enjoy all of the flavours you know and love from an aubergine parmigiana, with a gut-health twist by adding fibre-packed lentils. Featuring tender aubergine simmered in a tomato and basil sauce, all finished with our signature creamy miso bechamel for a crispy cheesy finish. Served with a side of seasonal leaves tossed in a classic French vinaigrette - you really can't beat it!Prep time1Total time30Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Take out a large ovenproof casserole dish and one mixing bowl, and preheat your oven to 200°C /180°C fan.STEP 2Trim the top and end of theaubergine, then slice it lengthways into 1.5cm thick slices.STEP 3Place the casserole dish over medium-high heat and add a generous drizzle of olive oil. Once hot, add theaubergineslices, season with salt, and sauté until tender in the centre and lightly golden on both sides, about 4-5 minutes per side. Remove the aubergine from the pan and set aside.STEP 4Drain thebrown lentilsand add them to the casserole dish along with thetomato sauce. Place the casserole dish over a medium heat and cook until the sauce is bubbling. Arrange the aubergine slices in the casserole so they are evenly distributed in the sauce. Push them down so they are partly submerged beneath the sauce but with some edges still sitting above the surface, so that they crisp up a little when baked. Pour the miso bechamel over the top, then place the dish into the oven and bake for 15 minutes or until the bechamel has thickened and browned a little on top.STEP 5In the meantime, toss the mixed leaf salad with thefrench vinaigretteand season to taste with salt and freshly ground black pepper.STEP 6To serve, divide theaubergine parmigianabetween serving bowls and add a side ofmixed leaf salad. Enjoy!What’s in your boxTomato SauceMiso BechamelAubergineBrown LentilsFrench VinaigretteMixed Leaf SaladNutritional infoAll nutritional values are based on a per person scale.Calories582kcalTotal fat23.4gSaturated fat3.2gSalt1.9gTotal carbohydrate71.6gTotal sugar18.6gFibre19.1gProtein21.4gIngredients / AllergensAubergine, lentils, garlic, tomato puree, basil, chopped tomatoes, paprika, sea salt, raw organic agave nectar, black pepper, rapeseed oil,soymilk, nutritional yeast, potato flakes, garlic powder, onion powder, rice vinegar, miso (soy), lemon, mixed leaves, red wine vinegar, dijonmustard, extra virgin olive oilFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 582.0,
      "protein_g": 21.4,
      "fat_g": 23.4,
      "carbs_g": 71.6,
      "fibre_g": 19.1,
      "salt_g": 1.9
    }
  },
  {
    "id": "chickpea-tuna-sushi-bowl-with-crunchy-sesame-slaw-creamy-avocado-zingy-ginger-soy-dressing",
    "title": "Chickpea 'Tuna' Sushi Bowl With Crunchy Sesame Slaw, Creamy Avocado & Zingy Ginger Soy Dressing",
    "source_url": "https://planthood.co.uk/products/chickpea-tuna-sushi-bowl-with-crunchy-sesame-slaw-creamy-avocado-zingy-ginger-soy-dressing",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Chickpea 'Tuna' Sushi Bowl With Crunchy Sesame Slaw, Creamy Avocado & Zingy Ginger Soy DressingPrep timeTotal timeCooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.CaloriesTotal fatSaturated fatSaltTotal carbohydrateTotal sugarFibreProteinIngredients / Allergens",
    "nutrition": {}
  },
  {
    "id": "chilli-garlic-tempeh-noodles-with-crunchy-rainbow-vegetables-sesame-seeds-spring-onion",
    "title": "High Protein Chilli Garlic Tempeh Noodles With Crunchy Rainbow Vegetables & Toasted Sesame Seeds",
    "source_url": "https://planthood.co.uk/products/chilli-garlic-tempeh-noodles-with-crunchy-rainbow-vegetables-sesame-seeds-spring-onion",
    "week_label": null,
    "weeks": [
      "Nov 17, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "High Protein Chilli Garlic Tempeh Noodles With Crunchy Rainbow Vegetables & Toasted Sesame SeedsTender, chewy noodles served with meaty tempeh in a smoky, spicy, umami-rich sauce featuring chilli, garlic, ginger, red miso and five spice. Served with crunchy rainbow vegetables like carrot, pak choi and red cabbage and finished with toasted sesame seeds and freshly sliced spring onions. With almost 40g of protein and 20g of fibre, it's as nutritious as it is delicious!Prep time5Total time15Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Boil your kettle, then take out a sauce pan and a deep frying pan or wok.STEP 2Fill your saucepan with boiling water from the kettle and place it over medium heat. Once the water is bubbling, add theudon noodlesand cook for 5-6 minutes, or until al dente. Drain and rinse well under cold running water, then leave them in a colander to drain.STEP 3Julienne thecarrotand finely slice thered cabbage(a mandolin can be helpful if you have one) andpak choi. Finely slice thespring onions, keeping the green and white parts separate. This is all your veg prep done.STEP 4Crumble thetempehinto small, bite-sized pieces. Place a frying pan or wok over medium-high heat and add a generous drizzle of neutral oil. Fry the crumbledtempehfor 6-8 minutes, until it starts to brown and turn crispy at the edges. Stir in one-third of thechili garlic tempeh sauceand make sure all the tempeh pieces are evenly coated. Set aside and keep warm.STEP 5Wipe clean or quickly rinse the frying pan or wok used for the tempeh if there are any burnt bits at the bottom. Place it back over medium-high heat and add another drizzle of neutral oil. Add the preparedcarrot, red cabbage,pak choi, and the white part of thespring onions, then stir-fry for 5 minutes.Add the drainedudon noodlesalong with the remainingchili garlic tempeh sauce, tossing everything to make sure it's well combined and evenly coated in the sauce. Add a splash of water if needed to prevent burning or sticking, and season to taste with salt or a splash of soy sauce (optional).STEP 5To serve, divide thenoodlesbetween serving bowls, top with thetempehand then garnish with the greenspring onionsand a sprinkle ofsesame garnish. Enjoy!What’s in your boxChilli Garlic Tempeh SauceOrganic TempehCarrotRed CabbagePak ChoiUdon NoodlesSpring OnionsSesame GarnishNutritional infoAll nutritional values are based on a per person scale.Calories665kcalTotal fat14.8gSaturated fat1.9gSalt3.1gTotal carbohydrate97.4gTotal sugar24.9gFibre19.8gProtein38.5gIngredients / AllergensGarlic, ginger, red chilli, tomato puree, low sodium gluten freesoysauce, raw organic agave nectar, rice vinegar, cornflour,sesameoil, red miso (soy), smoked paprika, five spice (coriander, cinnamon, fennel, ginger, cloves, dill, aniseed, star anise), organic tempeh (soybeans, tempeh culture (gluten-free rice flour, inoculum)), carrot, red cabbage, pak choi, udon noodles (wheat flour(gluten), water, salt), blacksesameseeds, whitesesameseeds, spring onionFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 665.0,
      "protein_g": 38.5,
      "fat_g": 14.8,
      "carbs_g": 97.4,
      "fibre_g": 19.8,
      "salt_g": 3.1
    }
  },
  {
    "id": "chilli-sin-carne",
    "title": "Smokey Black Bean Chilli With House Pickles, Coconut Yoghurt & Tostada Dippers",
    "source_url": "https://planthood.co.uk/products/chilli-sin-carne",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Smokey Black Bean Chilli With House Pickles, Coconut Yoghurt & Tostada DippersOur spicy, smokey three bean chilli is layered with a multitude of complex flavours like cumin, allspice, cinnamon and chilli, all offset by cooling coconut yoghurt, freshened up with a citrusy pickled slaw and served with crispy corn tortilla dippers. Full of protein and fibre thanks to a medley of beans and veggies.Prep timeTotal timeCooking Mode:\nCooking instructionsOur spicy, smokey three bean chilli is layered with a multitude of complex flavours like cumin, allspice, cinnamon and chilli, all offset by cooling coconut yoghurt, freshened up with a citrusy pickled slaw and served with crispy corn tortilla dippers. Full of protein and fibre thanks to a medley of beans and veggies.NutritionCalories 620kcal; Protein 29g; Fat 19.2g; Saturated Fat 11.4g; Total Carbs 94.9g; Fibre 21.2g; Salt 1.2gIngredientsCumin, allspice, chilli flakes, oregano, cinnamon, onion, carrot, kidney beans, cannellini beans, black beans,walnuts, plum tomatoes,soysauce, water, basmati rice, coconut yoghurt (coconut milk, coconut water, cornflour, potato starch, pectin, non-dairy cultures (s. thermophilus + l. bulgaricus, lactobacillus acidophilus, bifidobacterium lactis), white corn tacos, cabbage, carrot, apple cider vinegar, salt, raw natural cane sugarAllergensNuts, soyPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories620kcalTotal fat19.2gSaturated fat11.4gSalt1.2gTotal carbohydrate94.9gTotal sugarFibre21.2gProtein29gIngredients / AllergensCumin, allspice, chilli flakes, oregano, cinnamon, onion, carrot, kidney beans, cannellini beans, black beans,walnuts, plum tomatoes,soysauce, water, basmati rice, coconut yoghurt (coconut milk, coconut water, cornflour, potato starch, pectin, non-dairy cultures (s. thermophilus + l. bulgaricus, lactobacillus acidophilus, bifidobacterium lactis), white corn tacos, cabbage, carrot, apple cider vinegar, salt, raw natural cane sugarAllergensNuts, soyPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 620.0,
      "protein_g": 29.0,
      "fat_g": 19.2,
      "carbs_g": 94.9,
      "fibre_g": 21.2,
      "salt_g": 1.2
    }
  },
  {
    "id": "chimichurri-cauliflower-steaks",
    "title": "Charred Cauliflower Steaks With Chimichurri, Pine Nuts & Pomegranate Seeds Over Creamy Butterbean Mash",
    "source_url": "https://planthood.co.uk/products/chimichurri-cauliflower-steaks",
    "week_label": null,
    "weeks": [
      "Oct 27, 2025",
      "Dec 15, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Charred Cauliflower Steaks With Chimichurri, Pine Nuts & Pomegranate Seeds Over Creamy Butterbean MashOur sweet and smokey cauliflower steaks are loaded with layers upon layers of flavour. Tossed in a sweet and smokey marinade, then charred and smothered in tahini sauce and a punchy chimichurri dressing. Served over a creamy butterbean puree and finished with a scattering of toasted pine nuts and pomegranate seeds.Prep time5Total time25Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture below) and rinse any raw grains, herbs or vegetables.STEP 1Preheat your oven to 220°C / 200°C fan and take out a large roasting tray and a small saucepan.STEP 2Remove any tough or damaged outer leaves from thecauliflower. Using a large knife, trim the base and cut the cauliflower into quarters, keeping the leaves intact. Rub some olive oil, salt, pepper and drizzle over thesmoky cauliflower marinade. Use your hands or a brush to spread the marinade and seasoning all over the cauliflower.Place on your roasting tray and roast in the oven for 20-30 minutes or until it's browning/blackening on the outside and tender but al dente in the centre.STEP 3In the meantime, drain thebutter beansand add them to a blender with half of thelemon tahini dressing. Blend to a smooth puree (you may need to add a little water if it's too thick).Alternatively if you don't have a blender, you can mash the beans with a fork or potato masher for a chunkier texture.When there's 5 minutes left on the cauliflower, add the tahini butterbean mash to your saucepan and warm through over a medium heat until piping hot, around 3-5 minutes. If it starts to stick, you may need to add water as you cook to loosen. Season generously with salt and pepper to taste.STEP 4Place your small frying pan over medium heat, and dry toast thepine nutsuntil golden.STEP 5To serve, spread thecreamy butter bean mashonto a large plate and place thecauliflower steakson top. Drizzle over thechimichurri dressingand the remaininglemon tahini dressing. Scatter withpomegranate seedsand toastedpine nuts, and finish with a drizzle of good-quality olive oil (optional). Enjoy!What’s in your boxSmokey Cauliflower MarinadeCauliflowerChimichurri DressingButterbeans (2 Tins)Lemon Tahini DressingPomegranate SeedsPine NutsNutritional infoAll nutritional values are based on a per person scale.Calories690kcalTotal fat37gSaturated fat5.2gSalt0.7gTotal carbohydrate65.8gTotal sugar16.6gFibre27.9gProtein32.1gIngredients / AllergensCauliflower, extra virgin olive oil, raw organic agave nectar, smoked paprika, jalapeno, sea salt, onion, garlic, red wine vinegar, parsley, coriander, lemon, tahini (sesame), rapeseed oil, black pepper, water, butter beans, pine nuts (nuts), pomegranate seedsFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 690.0,
      "protein_g": 32.1,
      "fat_g": 37.0,
      "carbs_g": 65.8,
      "fibre_g": 27.9,
      "salt_g": 0.7
    }
  },
  {
    "id": "chinese-pancakes-with-crispy-pulled-oyster-mushrooms-date-hoi-sin-fresh-cucumber-spring-onions",
    "title": "Chinese Pancakes With Crispy Pulled Oyster Mushrooms, Date Hoi Sin, Fresh Cucumber & Spring Onions",
    "source_url": "https://planthood.co.uk/products/chinese-pancakes-with-crispy-pulled-oyster-mushrooms-date-hoi-sin-fresh-cucumber-spring-onions",
    "week_label": null,
    "weeks": [
      "Oct 27, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Chinese Pancakes With Crispy Pulled Oyster Mushrooms, Date Hoi Sin, Fresh Cucumber & Spring OnionsOur healthy vegan spin on a Chinese classic. Pulled oyster mushrooms are tossed in cornstarch, fried until deliciously crispy, then piled onto soft pancakes and smothered in a sweet and tangy date hoi sin sauce. Freshened up with crunchy cucumber and shredded spring onion.Prep time5Total time15Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Take out a large non-stick frying pan and set a steamer over the hob if you don't have a microwave for warming the pancakes.STEP 2Use your hands to pull apart theoystermushroomsinto thin strips. Place thecornstarchinto a large bowl, season well with salt and pepper, then add theoystermushroomsand give them a good mix so until coated evenly. Place your non-stick frying pan over a medium heat and add a drizzle of oil. Once hot, fry theoystermushroomsin batches until golden and crispy, around 10-15 minutes. Make sure you fry in batches leaving space between the mushrooms, otherwise they won't crisp up.  If they stick together as you cook, break them up regularly, using two forks. Keep frying until they're all golden and crispy on all sides. Season the mushrooms with sea salt to taste.STEP 3Meanwhile, finely slice thespringonionslengthways (including the green bits!) and cut thecucumberinto matchsticks. Julienne thecarrot, or you can use a vegetable peeler to make ribbons. Pierce the film packet thepancakesare in, then place in your steamer for 4-5 minutes or microwave on a low heat for 30 seconds.STEP 4Divide thepancakesbetween serving plates, then load them up with ahoisinsauce and crispyoystermushrooms. Finish with a garnish ofspringonion,cucumberandcarrot. Enjoy!What’s in your boxHoisin SauceOyster MushroomsChinese PancakeCornflourCucumberSpring OnionsCarrotNutritional infoAll nutritional values are based on a per person scale.Calories479kcalTotal fat4.5gSaturated fat0.2gSalt1gTotal carbohydrate97.4gTotal sugar22.6gFibre9.1gProtein13.7gIngredients / AllergensOyster mushroom, cucumber, spring onion, carrot, chinese pancakes (gluten), dates, raw organic agave nectar, garlic, ginger, rice vinegar, gluten freesoysauce, roastedsesameoil, five spice (coriander, cinnamon, fennel, ginger, cloves, dill, aniseed, star anise),peanutbutter, gochujang (tapioca, brown rice, red pepper powder, salt, alcohol,soybeans, garlic, onion), apple juice, water, cornflourFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 479.0,
      "protein_g": 13.7,
      "fat_g": 4.5,
      "carbs_g": 97.4,
      "fibre_g": 9.1,
      "salt_g": 1.0
    }
  },
  {
    "id": "chipotle-black-bean-burrito-bowl-with-roasted-sweet-potato-avocado-salsa-roja-lime-crema-tortilla-dippers",
    "title": "Chipotle Black Bean Burrito Bowl With Roasted Sweet Potato, Avocado, Salsa Roja, Lime Crema & Tortilla Dippers",
    "source_url": "https://planthood.co.uk/products/chipotle-black-bean-burrito-bowl-with-roasted-sweet-potato-avocado-salsa-roja-lime-crema-tortilla-dippers",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Chipotle Black Bean Burrito Bowl With Roasted Sweet Potato, Avocado, Salsa Roja, Lime Crema & Tortilla DippersPrep timeTotal timeCooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.CaloriesTotal fatSaturated fatSaltTotal carbohydrateTotal sugarFibreProteinIngredients / Allergens",
    "nutrition": {}
  },
  {
    "id": "courgette-gratin-with-cashew-cheese-sauce-creamy-cannellini-beans-and-olive-almond-gremolata",
    "title": "Courgette Gratin With Cashew Cheese Sauce, Creamy Cannellini Beans And Olive & Almond Gremolata",
    "source_url": "https://planthood.co.uk/products/courgette-gratin-with-cashew-cheese-sauce-creamy-cannellini-beans-and-olive-almond-gremolata",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Courgette Gratin With Cashew Cheese Sauce, Creamy Cannellini Beans And Olive & Almond GremolataPrep timeTotal timeCooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.CaloriesTotal fatSaturated fatSaltTotal carbohydrateTotal sugarFibreProteinIngredients / Allergens",
    "nutrition": {}
  },
  {
    "id": "creamy-butter-beans-with-burnt-lemon-mustard-sauce-wilted-greens-charred-cauliflower-green-olive-salsa",
    "title": "Creamy Butter Beans With Burnt Lemon & Mustard Sauce, Wilted Greens, Charred Cauliflower & Green Olive Salsa",
    "source_url": "https://planthood.co.uk/products/creamy-butter-beans-with-burnt-lemon-mustard-sauce-wilted-greens-charred-cauliflower-green-olive-salsa",
    "week_label": null,
    "weeks": [
      "Dec 08, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Creamy Butter Beans With Burnt Lemon & Mustard Sauce, Wilted Greens, Charred Cauliflower & Green Olive SalsaBoosting your gut health has never been tastier than with this creamy beany bowl of deliciousness. Tender butter beans are simmered in a creamy lemon and mustard sauce with wilted dark leafy greens. At home you'll serve it with another portion of fibre-packed veg in the form of charred cauliflower and then smother it in a final flavour bomb of zingy green olive salsa.Prep time2Total time15Cooking Mode:\nCooking instructionsCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Preheat your oven to 220°C / 200°C fan and take out a baking tray and a deep frying pan or wok.STEP 2Place thecauliflowerin your baking tray, drizzle with some olive oil and season generously with salt and black pepper. Roast for 15-18 mins, shaking halfway through.STEP 3Next, char thelemon. Place your frying pan over a medium-high heat and slice the lemon in half. Once the pan is hot, place the lemon cut side down into the pan and fry for 2-3 minutes or until golden and charred. Remove and set to the side. Clean the pan if needed (some light browning is OK, but if there’s lots of residual burn it will affect the flavour of the sauce).STEP 4Remove the stems from thecavolonero, then chop the leaves into bite sized pieces and add these to the hot pan with a little salt and olive oil. Stir fry on medium heat for 2-3 minutes until it has darkened and has begun to wilt.Drain thebutter beans, reserving all of the liquid. Add the butter beans and thelemon & mustard sauceto the pan with the cavolo nero and bring to a gentle simmer and cook for 3–4 minutes, until the beans and greens have softened. Gradually add the reserved bean liquid while the sauce simmers, until you reach a creamy consistency.Squeeze in the juice from one half of theburnt lemonto finish.STEP 5To serve, ladle thecreamybeansinto serving bowls, top with theroastedcauliflowerandgreen olive salsa. We recommend squeezing over the other half of lemon but you can omit this if you feel the dish has enough acidity for your preference. Enjoy!What’s in your boxLemon & Mustard SauceGreen Olive SalsaCavolo NeroButter BeansCauliflower FloretsLemonNutritional infoAll nutritional values are based on a per person scale.Calories530kcalTotal fat28.3gSaturated fat4gSalt3.2gTotal carbohydrate53.9gTotal sugar9gFibre18.2gProtein23.2gIngredients / AllergensButter beans, cavolo nero, lemon, cauliflower, green olives, green chilli, sherry vinegar (sulphites), cumin powder, fennel powder, chilli flakes, parsley, coriander, preserved lemon paste, extra virgin olive oil, salt, tahini (sesame), wholegrainmustard, lemon juice, nutritional yeast, garlic powder, onion powder, white miso (soybeans, water, rice, salt), black pepperFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 530.0,
      "protein_g": 23.2,
      "fat_g": 28.3,
      "carbs_g": 53.9,
      "fibre_g": 18.2,
      "salt_g": 3.2
    }
  },
  {
    "id": "creamy-butterbeans-with-caramelised-leeks-charred-courgettes-drizzled-with-olive-almond-pesto",
    "title": "Creamy Butter Beans With Caramelised Leeks, Charred Courgettes, Drizzled With Olive & Almond Pesto",
    "source_url": "https://planthood.co.uk/products/creamy-butterbeans-with-caramelised-leeks-charred-courgettes-drizzled-with-olive-almond-pesto",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Creamy Butter Beans With Caramelised Leeks, Charred Courgettes, Drizzled With Olive & Almond PestoPrep timeTotal timeCooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.CaloriesTotal fatSaturated fatSaltTotal carbohydrateTotal sugarFibreProteinIngredients / Allergens",
    "nutrition": {}
  },
  {
    "id": "creamy-cauliflower-aubergine-korma-with-toasted-cashews-fresh-coriander-rice",
    "title": "Creamy Cauliflower & Aubergine Korma With Toasted Cashews, Fresh Coriander & Rice",
    "source_url": "https://planthood.co.uk/products/creamy-cauliflower-aubergine-korma-with-toasted-cashews-fresh-coriander-rice",
    "week_label": null,
    "weeks": [
      "Nov 10, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Creamy Cauliflower & Aubergine Korma With Toasted Cashews, Fresh Coriander & RiceOur plant-based spin on one of the nation's favourite dishes. Charred cauliflower bites paired with silky, melt-in-your mouth aubergine in a delicious korma sauce that's fragrant with spices, creamy from the coconut base and balanced with freshly squeezed lemon for an extra layer of flavour. Served with a topping of toasted cashews and fresh coriander alongside fluffy rice.Prep time2Total time15Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Preheat your oven to 200°C / 180°C fan, boil your kettle, then take out a roasting tray, frying pan and saucepan.STEP 2Cut theaubergineinto 1.5cm cubes and place them along with thecauliflowerfloretsinto your roasting tray, toss in a drizzle of oil and season well with salt and pepper. Roast for 15 minutes or until tender and beginning to char.STEP 3Place your frying pan over a medium heat, then add thecashewsto toast for around 2-3 minutes. Remove and set aside.STEP 4Place thebasmatiriceinto your saucepan and cover with 2.5x its volume in boiling water from your kettle. Cook over a medium heat until tender but al dente, around 8-10 minutes.STEP 5Once thecauliflowerandaubergineare cooked, combine in your frying pan along with thekormasauceand cook until piping hot, around 2-3 minutes. Meanwhile, roughly chop thecorianderleaves.STEP 6Divide thecauliflowerandauberginekormaandricebetween serving bowls, garnish with the toastedcashewsand a scattering of freshcoriander. EnjoyWhat’s in your boxKorma SauceCauliflower FloretsAubergineCashewsCorianderBasmati RiceNutritional infoAll nutritional values are based on a per person scale.Calories694kcalTotal fat28.7gSaturated fat20.4gSalt0.1gTotal carbohydrate96.8gTotal sugar18.4gFibre13.5gProtein17.1gIngredients / AllergensCauliflower, aubergine,cashews (nuts), coriander, basmati rice, onion, ginger, garlic, tomato puree, garam masala (coriander, cinnamon, cloves, ginger, star anise, cumin, chilli, fennel, black pepper, bay leaves, sunflower oil, nutmeg, cardamon), cumin powder, turmeric powder, onion powder, garlic powder, cardamon powder, coconut milk, coconut yoghurt (coconut milk (coconut extract, coconut water, water), coconut water (23%), cornflour, potato starch, stabilizer (pectin*), non-dairy cultures (s. thermophilus + l. bulgaricus, lactobacillus acidophilus, bifidobacterium lactis), creamed coconut, salt, lemon juiceFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 694.0,
      "protein_g": 17.1,
      "fat_g": 28.7,
      "carbs_g": 96.8,
      "fibre_g": 13.5,
      "salt_g": 0.1
    }
  },
  {
    "id": "creamy-coconut-daal",
    "title": "Creamy Coconut Daal With Spice Roasted Cauliflower, Crispy Kale & Coconut Yoghurt",
    "source_url": "https://planthood.co.uk/products/creamy-coconut-daal",
    "week_label": null,
    "weeks": [
      "Nov 17, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Creamy Coconut Daal With Spice Roasted Cauliflower, Crispy Kale & Coconut YoghurtOur take on an Indian classic. Protein and fibre-packed red lentils are gently cooked in coconut milk with turmeric, cardamom, ginger, garlic and garam masala, crowned with spice roasted cauliflower bites, crispy kale and cooling coconut yoghurt. Served with fluffy rice.Prep time2Total time15Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Preheat the oven to 220°C / 200°C fan, then take out a large roasting tray and two saucepans.STEP 2Cut any larger pieces ofcauliflowerso they're all roughly 1.5-2cm squared in size. Place into your roasting tray, add a drizzle of oil, season with thespicemix(add half if you don't like too much spice!), salt and pepper and give everything a good toss to coat. Roast for 15-20 minutes or until golden and tender.STEP 3Add thedaalsauce,redlentilsand 300ml of water to your other saucepan and cook for 10-15 mins until the lentils are soft and tender. Stir occasionally while cooking and add a splash of water as needed if it reduces too much or starts to stick. Season to taste with salt.STEP 4Remove any hardy stems from thecavolonerothen chop into bitesized pieces. Once the cauliflower has had 10 minutes in the oven, add the kale to one side of the roasting tray, toss in a little oil, season with salt and roast for the final 5 minutes of cooking time, or until the kale is nice and crispy.STEP 5Place thericein a small saucepan and cover with 2x its volume in water. Bring to the boil, then reduce the heat and cover. Allow to cook for a further 8-10 minutes or until tender.STEP 6Divide thedaalbetween serving bowls, top with crispycavolonero, roastedcauliflower, a squeeze of freshlimejuice and a dollop of creamycoconutyoghurt. Serve alongside your fluffyriceand enjoy!What’s in your boxDaal SauceCauliflower Spice MixCauliflower FloretsCavolo NeroCoconut YoghurtLimeRed LentilsBasmati RiceNutritional infoAll nutritional values are based on a per person scale.Calories610kcalTotal fat44gSaturated fat37.9gSalt0.25gTotal carbohydrate95gTotal sugarFibre16.6gProtein27.1gIngredients / AllergensRed lentils, cardamom, cinnamon, onion, garlic, ginger, green chilli, ground coriander, garam masala, turmeric, cavolo nero, coconut milk, brownmustardseeds, lime, cauliflower, curry powder (mustard), cumin seeds, coconut yoghurt (coconut milk (coconut extract, coconut water, water), coconut water, cornflour, potato starch, stabilizer (pectin), non-dairy cultures (s. thermophilus + l. bulgaricus, lactobacillus acidophilus, bifidobacterium lactis), basmati riceFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 610.0,
      "protein_g": 27.1,
      "fat_g": 44.0,
      "carbs_g": 95.0,
      "fibre_g": 16.6,
      "salt_g": 0.25
    }
  },
  {
    "id": "creamy-gochujang-tofu-bowl-with-wakame-cucumber-pickle-avocado-sesame-gochugaru-nori-snacks",
    "title": "Creamy Gochujang Tofu Bowl With Wakame Cucumber Pickle, Avocado, Sesame Gochugaru & Nori Snacks",
    "source_url": "https://planthood.co.uk/products/creamy-gochujang-tofu-bowl-with-wakame-cucumber-pickle-avocado-sesame-gochugaru-nori-snacks",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Creamy Gochujang Tofu Bowl With Wakame Cucumber Pickle, Avocado, Sesame Gochugaru & Nori SnacksPrep timeTotal timeCooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.CaloriesTotal fatSaturated fatSaltTotal carbohydrateTotal sugarFibreProteinIngredients / Allergens",
    "nutrition": {}
  },
  {
    "id": "creamy-green-goddess-beans-courgettes-with-organic-cultured-yoghurt-pistachio-zaatar-flatbread",
    "title": "Creamy Green Goddess Beans & Courgettes With Organic Cultured Yoghurt, Pistachio Za'atar & Flatbread",
    "source_url": "https://planthood.co.uk/products/creamy-green-goddess-beans-courgettes-with-organic-cultured-yoghurt-pistachio-zaatar-flatbread",
    "week_label": null,
    "weeks": [
      "Nov 03, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Creamy Green Goddess Beans & Courgettes With Organic Cultured Yoghurt, Pistachio Za'atar & FlatbreadTender butter beans are simmered in our super green, luxuriously creamy, pesto infused sauce, served with charred courgettes, in this high protein, gut-friendly dish. At home you'll finish it with charred courgettes, creamy organic cultured yoghurt, a crunchy toasted pistachio za'atar topping and garlic flatbread for dipping and dunking.Prep time2Total time10Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Take out a deep frying pan and a second wide frying pan.STEP 2Place a frying pan over medium heat and add a drizzle of olive oil. While it heats, finely slice thecourgette,and add to the pan with a pinch of salt and fry for 8 minutes, or until softened. Drain and rinse the cannellini beans, then add them to the pan along with the green goddess sauce.In a blender, or in a bowl with a hand blender, blend thebaby spinachwith 50ml of water (double the amount for a 4-person portion) until smooth, then add it to the sauce and beans. We send the spinach separately to ensure the beautiful vibrant green sauce colour, but if don’t have a blender, you can finely chop the spinach instead. Stir everything together and cook for a few minutes until heated through.STEP 3Add a generous drizzle of olive oil (we recommend a 2 tablespoons, but you could use less) to your other frying pan, along with thepistachio and za'atar. Heat until the nuts are lightly toasted, around 2-3 minutes. Watch carefully to ensure it doesn't burn. Remove all of the oil, nuts and spices from the pan and place into a ramekin or small bowl. Toast theflatbreadin the pan for a few minutes to warm through, then cut into quarters.STEP 4To serve, divide the creamygreen goddess beansbetween serving bowls, then garnish with a few dollops ofyoghurtand thepistachio and za'atar drizzle. Serve theflatbreadalongside to scoop it up. Enjoy!What’s in your boxGreen Goddess SaucePistachio and Za'atarCannellini BeansCourgetteGarlic Spiked Organic Soy YoghurtBaby SpinachGarlic & Herb FlatbreadNutritional infoAll nutritional values are based on a per person scale.Calories596.1kcalTotal fat16.3gSaturated fat2.1gSalt3.1gTotal carbohydrate73.4gTotal sugar8gFibre19.5gProtein34.7gIngredients / AllergensCannellini beans, courgette, organic cultured soy yoghurt (soybeans, water, selected live cultures (Bifidus, Acidophilus)), garlic, sea salt, raw organic agave nectar, garlic & herb flatbread (wheat flour (gluten), salt, yeast, vegetable oil, garlic, mixed herbs), baby spinach, soy milk (soybeans), water, tahini (sesame), extra virgin olive oil, basil, fresh dill, black pepper, nutritional yeast, fresh lemon juice, ground coriander, silken tofu (soybeans, nigari), pistachios (nuts), oregano, thyme, cumin,sesameseeds, aleppo chilliFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 1.0,
      "protein_g": 34.7,
      "fat_g": 16.3,
      "carbs_g": 73.4,
      "fibre_g": 19.5,
      "salt_g": 3.1
    }
  },
  {
    "id": "creamy-kimchi-macaroni-with-roasted-broccoli-garlic-panko-breadcrumbs",
    "title": "Creamy Kimchi Macaroni With Roasted Broccoli & Garlic Panko Breadcrumbs",
    "source_url": "https://planthood.co.uk/products/creamy-kimchi-macaroni-with-roasted-broccoli-garlic-panko-breadcrumbs",
    "week_label": null,
    "weeks": [
      "Nov 10, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Creamy Kimchi Macaroni With Roasted Broccoli & Garlic Panko BreadcrumbsThis creamy, umami packed macaroni is an updated, Korean inspired, healthy version of a nostalgic classic. Kimchi not only adds tonnes of flavour but is great for your gut microbiome too. The crispy, garlicky breadcrumbs and the roasted broccoli add even more layers of flavour and texture. It’s comfort food at its best.Prep time1Total time10Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Boil your kettle and preheat your oven to 200°C / 180°C fan. Take out a large saucepan, a small frying pan and a roasting tray.STEP 2Cut thebroccoliinto bite-sized pieces. Lay them on a baking tray in a single layer with a drizzle of olive oil and season with salt and pepper. Roast for 10-15 mins until golden, tossing once.STEP 3Pour boiling water into your saucepan, add themacaronipasta, then place over the heat and salt the water well. Boil the pasta for 8 minutes or until al dente. Scoop out a mug of pasta water, then drain and return the pasta to the pan.STEP 4Place your frying pan over medium heat, and dry fry (without oil) thegarlic breadcrumbsmix until lightly toasted. Finely chop thespringonionand keep the white half separate from the green. Chop thevegan kimchiinto smaller bite-sized pieces (don’t throw away the juices as they’re packed with flavour and probiotics!).STEP 5Add thegochujang 'cheese' sauce,springonionwhites, andkimchito the pot with themacaroniand stir to heat through. Add a few splashes of pasta water as needed to make the sauce silky. Add the cookedbroccoliand stir again until just combined.STEP 6To serve, ladle the creamymacaroniinto bowls and top with the crispygarlic breadcrumbsand thespringoniongreens. Enjoy!(NB: If saving some for leftovers, heat it with a splash of vegan milk, reserved pasta water or water, as the pasta will absorb a lot of the sauce as it sits)What’s in your boxGochujang 'Cheese' SauceBroccoliVegan KimchiGarlic BreadcrumbsMacaroniSpring OnionsNutritional infoAll nutritional values are based on a per person scale.Calories767kcalTotal fat24.6Saturated fat4.8Salt2.4gTotal carbohydrate116gTotal sugarFibre11.6gProtein29.1gIngredients / AllergensBroccoli, spring onion, cashews (nuts), carrot juice, gluten freesoysauce, soy milk (soybeans), nutritional yeast, garlic powder, onion powder, rice vinegar, white miso (soybeans, rice, salt, yeast, koji culture), raw organic agave nectar, gochujang (tapioca, brown rice, red pepper powder, salt, alcohol,soybeans, garlic, onion), fresh lemon juice, sea salt, panko breadcrumbs (gluten), crispy fried garlic, gochugaru chilli flakes, vegan kimchi (cabbage, carrot, daikon, spring onion, apple, chilli, tamari (soybeans, salt), chilli powder, ginger, garlic, salt, vegan cultures), macaroni (gluten)For allergens, please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 767.0,
      "protein_g": 29.1,
      "carbs_g": 116.0,
      "fibre_g": 11.6,
      "salt_g": 2.4
    }
  },
  {
    "id": "creamy-mattar-makhani-with-tofu-paneer-kachumbar-salad-garlic-herb-naan",
    "title": "Creamy Mattar Makhani with Tofu 'Paneer', Zingy Kachumbar Salad & Soft Garlic Naan",
    "source_url": "https://planthood.co.uk/products/creamy-mattar-makhani-with-tofu-paneer-kachumbar-salad-garlic-herb-naan",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Creamy Mattar Makhani with Tofu 'Paneer', Zingy Kachumbar Salad & Soft Garlic NaanOur plant-based spin on the popular North Indian pea and paneer curry is rich, creamy and incredibly flavourful. Tofu and peas are gently simmered in coconut milk and tomatoes with onion, garlic, turmeric and cardamom, then served alongside a zingy chopped salad made from red onion, cherry tomatoes, coriander and lime. Served with a pillowy soft garlic and herb naan to scoop up all those delicious flavours.Prep timeTotal timeCooking Mode:\nCooking instructionsOur plant-based spin on the popular North Indian pea and paneer curry is rich, creamy and incredibly flavourful. Tofu and peas are gently simmered in coconut milk and tomatoes with onion, garlic, turmeric and cardamom, then served alongside a zingy chopped salad made from red onion, cherry tomatoes, coriander and lime. Served with a pillowy soft garlic and herb naan to scoop up all those delicious flavours.NutritionCalories 582kcal; Protein 21.1g; Fat 28.4g; Saturated Fat 17.4g; Total Carbs 66.8g; Fibre 10.6g; Salt 0.8gIngredientsOnion, garlic, ginger, cardamom, turmeric, cinnamon, cumin, cloves, chilli flakes, ground coriander, coconut cream, plum tomatoes, water, peas, tofu (soy), cherry tomatoes, red onion, lime, coriander, garlic & herb naan (wheatflour, salt, water, garlic, dried herbs)Allergenswheat, soyPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories582kcalTotal fat28.4gSaturated fat17.4gSalt0.8gTotal carbohydrate66.8gTotal sugarFibre10.6gProtein21.1gIngredients / AllergensOnion, garlic, ginger, cardamom, turmeric, cinnamon, cumin, cloves, chilli flakes, ground coriander, coconut cream, plum tomatoes, water, peas, tofu (soy), cherry tomatoes, red onion, lime, coriander, garlic & herb naan (wheatflour, salt, water, garlic, dried herbs)Allergenswheat, soyPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 582.0,
      "protein_g": 21.1,
      "fat_g": 28.4,
      "carbs_g": 66.8,
      "fibre_g": 10.6,
      "salt_g": 0.8
    }
  },
  {
    "id": "creamy-orzo-al-limone-with-crispy-panko-tofu-roasted-cherry-tomatoes-tenderstem-broccoli",
    "title": "Creamy Orzo Al Limone With Crispy Panko Tofu, Roasted Cherry Tomatoes & Tenderstem Broccoli",
    "source_url": "https://planthood.co.uk/products/creamy-orzo-al-limone-with-crispy-panko-tofu-roasted-cherry-tomatoes-tenderstem-broccoli",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Creamy Orzo Al Limone With Crispy Panko Tofu, Roasted Cherry Tomatoes & Tenderstem BroccoliLike a risotto, but brighter and lighter, made with orzo in a creamy cashew sauce infused with lemon, mustard and parmesan-style flavours like miso and nutritional yeast. Served with crispy golden panko tofu, sweet roasted cherry tomatoes on the vine and vitamin-rich tenderstem broccoli. It's delicious and nutritious, with almost 40g of protein per serving.Prep timeTotal timeCooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Preheat your oven to 200°C / 180°C fan, boil your kettle, and take out a roasting tray, a large saucepan and as frying pan.STEP 2Fill a saucepan with boiling water and place it over medium heat. Once boiling, add theorzoand cook for 9 minutes, or until al dente. Scoop out a cup of the pasta water for later, then drain the orzo and set it aside.STEP 3Place thecherry tomatoesandtenderstem broccolion a baking tray, and drizzle with some good-quality olive oil. Season with salt and pepper, then roast for 10–15 minutes, until the tomatoes begin to burst and the tenderstem broccoli is lightly charred.STEP 4Take out two large bowls. Place the dry mix into a bowl and measure out 40ml (80ml for a 4-person portion) of plant milk (or water if you don’t have milk). Slowly add the milk or water and stir until you have a thick batter. Season well with salt and pepper and stir thoroughly until combined. Pour thepankointo the other bowl and season with salt and pepper. Cut thetofuin half lengthwise, then in half again so you have four thin 'steak' like slices. Pat dry each piece with a sheet of kitchen towel and coat them in the batter, then toss it in the panko. Press gently to ensure the panko evenly covers all sides.STEP 5Add about 1 cm of neutral oil to a frying pan and place it over medium-low heat. You can just add a drizzle of oil if you prefer but the tofu won't get quite as crispy. Once the oil is hot enough to sizzle when a small amount of panko is added, carefully place the coatedtofuin the pan to fry. Turn the tofu as each side becomes crispy, cooking until all sides are golden, around 5 minutes total. Remove from the pan and place on kitchen paper to drain any excess oil.STEP 6Place the saucepan you used for the orzo over a medium heat, add thecreamy lemon sauceand gently warm through for a few minutes. Add the cooked orzo and stir well, then add a little of the reserved pasta water to loosen the sauce to your preferred consistency. Season to taste with salt and pepper.What’s in your boxCreamy Lemon SauceOrzoCherry Tomatoes on the VineOrganic TofuPankoBroccoliDry MixNutritional infoAll nutritional values are based on a per person scale.Calories653kcalTotal fat19.2gSaturated fat2.7gSalt2.3gTotal carbohydrate85.3gTotal sugar12.2gFibre9.2gProtein36.6gIngredients / AllergensOrzo (drum wheat flour (gluten)), tofu (soybeans, nigari), white flour (gluten), smoked sweet paprika, onion powder, garlic powder, panko breadcrumbs (gluten), garlic, cashews (nuts), soy milk (soybeans), wholegrainmustard, nutritional yeast, white miso (soybeans, rice, salt, yeast, koji culture), gluten free soy sauce (soy), black pepper, sea salt, raw organic agave nectar, fresh lemon juice, broccoli, cherry tomatoes on the vineFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 653.0,
      "protein_g": 36.6,
      "fat_g": 19.2,
      "carbs_g": 85.3,
      "fibre_g": 9.2,
      "salt_g": 2.3
    }
  },
  {
    "id": "creamy-panang-curry-with-tofu-red-pepper-baby-spinach-sticky-jasmine-rice-crushed-peanuts-lime",
    "title": "Creamy Panang Curry With Tofu, Red Pepper, Baby Spinach, Sticky Jasmine Rice, Crushed Peanuts & Lime",
    "source_url": "https://planthood.co.uk/products/creamy-panang-curry-with-tofu-red-pepper-baby-spinach-sticky-jasmine-rice-crushed-peanuts-lime",
    "week_label": null,
    "weeks": [
      "Nov 17, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Creamy Panang Curry With Tofu, Red Pepper, Baby Spinach, Sticky Jasmine Rice, Crushed Peanuts & LimePanang curry is a type of Thai red curry, featuring aromatic kaffir lime leaves, lemongrass, cumin, coriander and some peanut butter resulting in a thicker, creamier sauce. We're serving it with tender chunks of tofu, vitamin C packed red pepper and iron rich baby spinach, served over sticky jasmine rice and finished with a squeeze of fresh lime and some toasted peanuts for crunch.Prep time2Total time15Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Pre-heat your oven to 220°C / 200°C fan, then take out a baking tray, small saucepan and a deep frying pan or wok.STEP 2Tear thetofuinto bitesized chunks, place into your roasting tray, toss through a drizzle of olive oil and season with salt and pepper. Roast for 20 minutes, turning halfway. The tofu should be starting to turn brown and crispy on the outside.STEP 3Place thejasmine riceinto your small saucepan, cover with 2x its volume in water and place over a medium-high heat. Bring to the boil, stir then reduce to low and cover with a lid. Cook until tender and fluffy, around 8-10 minutes. If it's finished before thetofu, just turn off the heat and leave the lid on so it stays warm.STEP 4Place your frying pan or wok over a medium heat and dry fry (without oil) thepeanutsto toast. Remove and set aside. Lightly crush or chop the peanuts and wipe the pan clean with some kitchen towel.STEP 5Remove the stem and core from theredpepperand then finely slice. You could also slice some of the red pepper very finely and set aside as a garnish (optional). Once there is around 8 minutes left of cooking time on the tofu, place your frying pan or wok over a medium heat and add a drizzle of oil. Stir fry theredpepperaround 3-5 minutes until slightly softened, then add thepanang curry sauceand thebabyspinach.Stir to combine and cook until the sauce is piping hot and the spinach has wilted, around 3 minutes. Add 50-100ml water (double the amount for a four-person portion) if the sauce reduces too much or starts to stick. Finally, stir through the roastedtofu, squeeze in the juice of half of thelimeand stir to combine. Season with salt to taste.STEP 6To serve up, divide thejasminericebetween serving bowls and spoon over the curry and vegetables. Finish with a scattering of crushedpeanuts,limejuice to taste and theredpeppergarnish if you made some. Enjoy!What’s in your boxPanang Curry SauceRed PepperBaby SpinachJasmine RiceOrganic TofuPeanutsLimeNutritional infoAll nutritional values are based on a per person scale.Calories745kcalTotal fat37.2gSaturated fat17.7gSalt2.2gTotal carbohydrate79.3gTotal sugar12.4gFibre11.7gProtein29.4gIngredients / AllergensGround coriander, ground cumin, nutmeg, lemongrass, garlic, tomato paste, lime leaves, onion, red chilli, raw organic agave nectar, coconut milk, coconut cream, lime juice, gluten free low sodium soy sauce (soy) water, salt,peanutbutter, red pepper, jasmine rice, baby spinach,peanuts, organic tofu (soybeans, water, nigari), limeFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, N",
    "nutrition": {
      "calories": 745.0,
      "protein_g": 29.4,
      "fat_g": 37.2,
      "carbs_g": 79.3,
      "fibre_g": 11.7,
      "salt_g": 2.2
    }
  },
  {
    "id": "creamy-romesco-butter-beans-with-lemon-charred-broccoli-mint-pesto-crushed-toasted-almonds",
    "title": "Creamy Romesco Butter Beans With Lemon Charred Broccoli, Mint Pesto & Crushed Toasted Almonds",
    "source_url": "https://planthood.co.uk/products/creamy-romesco-butter-beans-with-lemon-charred-broccoli-mint-pesto-crushed-toasted-almonds",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Creamy Romesco Butter Beans With Lemon Charred Broccoli, Mint Pesto & Crushed Toasted AlmondsPrep timeTotal timeCooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.CaloriesTotal fatSaturated fatSaltTotal carbohydrateTotal sugarFibreProteinIngredients / Allergens",
    "nutrition": {}
  },
  {
    "id": "creamy-saag-tofu-paneer-with-sweet-roasted-cherry-tomatoes-soft-garlic-naan",
    "title": "Creamy Saag Tofu 'Paneer' With Sweet Roasted Cherry Tomatoes & Soft Garlic Naan",
    "source_url": "https://planthood.co.uk/products/creamy-saag-tofu-paneer-with-sweet-roasted-cherry-tomatoes-soft-garlic-naan",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Creamy Saag Tofu 'Paneer' With Sweet Roasted Cherry Tomatoes & Soft Garlic NaanOur plant-based spin on the popular North Indian saag paneer curry is rich, creamy and incredibly flavourful. Fresh iron-rich baby spinach is slowly cooked in coconut milk and tomato with garlic, cumin and garam masala, then stirred through with a swirl of rich coconut cream. Served with sweet bursting roasted cherry tomatoes and a scattering of fresh coriander, with a pillowy soft garlic and herb naan to mop up all the delicious flavours.Prep timeTotal timeCooking Mode:\nCooking instructionsOur plant-based spin on the popular North Indian saag paneer curry is rich, creamy and incredibly flavourful. Fresh iron-rich baby spinach is slowly cooked in coconut milk and tomato with garlic, cumin and garam masala, then stirred through with a swirl of rich coconut cream. Served with sweet bursting roasted cherry tomatoes and a scattering of fresh coriander, with a pillowy soft garlic and herb naan to mop up all the delicious flavours.NutritionCalories 605kcal; Protein 28.1g; Fat 31.7g; Saturated Fat 19.5g; Total Carbs 66g; Fibre 8.7g; Salt 0.9gIngredientsOnion, garlic, ginger, green chilli, cumin, garam masala, plum tomatoes, baby spinach, coconut milk, coconut cream, lemon juice, mango chutney (mangoes, garlic cloves, cumin seeds, mixed spices, fenugreek seeds, nigella seeds, black peppercorns, cardamom pods, whole clove, herb, cane sugar, salt, acetic acid), organic tofu (soyabeans, nigari, water), coriander, garlic naan (yeast,wheatflour,water, salt,sesameseeds, vegetable oil, herbs and spices)AllergensFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories605kcalTotal fat31.7gSaturated fat19.5gSalt0.9gTotal carbohydrate66gTotal sugarFibre8.7gProtein28.1gIngredients / AllergensOnion, garlic, ginger, green chilli, cumin, garam masala, plum tomatoes, baby spinach, coconut milk, coconut cream, lemon juice, mango chutney (mangoes, garlic cloves, cumin seeds, mixed spices, fenugreek seeds, nigella seeds, black peppercorns, cardamom pods, whole clove, herb, cane sugar, salt, acetic acid), organic tofu (soyabeans, nigari, water), coriander, garlic naan (yeast,wheatflour, water, salt,sesameseeds, vegetable oil, herbs and spices)AllergensFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 605.0,
      "protein_g": 28.1,
      "fat_g": 31.7,
      "carbs_g": 66.0,
      "fibre_g": 8.7,
      "salt_g": 0.9
    }
  },
  {
    "id": "creamy-squash-bucatini-with-wilted-cavolo-nero-crispy-tempeh-pancetta",
    "title": "High Protein Creamy Squash Bucatini With Wilted Cavolo Nero & Crispy Tempeh 'Pancetta'",
    "source_url": "https://planthood.co.uk/products/creamy-squash-bucatini-with-wilted-cavolo-nero-crispy-tempeh-pancetta",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "High Protein Creamy Squash Bucatini With Wilted Cavolo Nero & Crispy Tempeh 'Pancetta'A deliciously rich, butternut squash sauce infused with miso for a gut-healthy kick, turned through tender bucatini with vitamin rich cavolo nero leaves. Finished with crispy tempeh 'pancetta' which boosts this meal to over 40g protein per serving and 1/2 your daily fibre intake.Prep time5Total time15Cooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories655kcalTotal fat11.6gSaturated fat2.4gSalt2.4gTotal carbohydrate99.4gTotal sugar20.1gFibre15gProtein40.9gIngredients / AllergensGarlic, water,soymilk, butternut squash, sundried tomatoes, organic silken tofu (soybeans, water, nigari), nutritional yeast, miso (soy), raw organic agave nectar, lemon juice, ground garlic, ground onion, sea salt, bucatini (wheat flour (gluten), salt, water), cavolo nero, organic tempeh (soyabeans, water, tempeh culture (gluten-free rice flour, inoculum)), apple cider vinegar, gluten free low sodiumsoysauce, chipotle, balsamic vinegar, cumin, ground coriander, paprika, sage, oreganoFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 655.0,
      "protein_g": 40.9,
      "fat_g": 11.6,
      "carbs_g": 99.4,
      "fibre_g": 15.0,
      "salt_g": 2.4
    }
  },
  {
    "id": "creamy-tomato-butterbeans-with-baby-spinach-almond-gremolata-pillowy-soft-garlic-herb-flatbread",
    "title": "Creamy Tomato Butter Beans With Baby Spinach, Almond Gremolata & Pillowy Soft Garlic & Herb Flatbread",
    "source_url": "https://planthood.co.uk/products/creamy-tomato-butterbeans-with-baby-spinach-almond-gremolata-pillowy-soft-garlic-herb-flatbread",
    "week_label": null,
    "weeks": [
      "Dec 01, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Creamy Tomato Butter Beans With Baby Spinach, Almond Gremolata & Pillowy Soft Garlic & Herb FlatbreadThis creamy, beany stew makes the most of tomato season. Think tender butter beans simmered in a rich, creamy, slightly spicy basil and sun dried tomato sauce. At home you'll serve it with blistered cherry tomatoes, wilted baby spinach and then drizzle it all over with a tangy almond and caper gremolata. Served with a pillowy soft freshly baked flatbread to mop up all those delicious, moreish flavours. With 30g of protein and 20g of fibre, this is the perfect meal to help you hit your health and nutrition goals.Prep time0Total time10Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Take out a small frying pan and a large saucepan or deep frying pan.STEP 2Add thecherrytomatoesto your small frying pan with a good drizzle of olive oil and a pinch of salt and cook on a medium heat for 4-5 mins, adding a splash or two of water if they start to dry out. They should start to split and blister, releasing some of their juices.STEP 3Add the tin ofbutter beanswith half of the liquid to your other large saucepan or deep frying pan along with thecreamy tomato sauceand simmer for 4-5 mins. Add thespinachin the last couple of minutes to wilt. Add a splash of water if you would like it to be more creamy.STEP 4Meanwhile, toast theflatbreadsin the oven or in a hot, dry pan on one side. Add a drizzle of olive oil and a sprinkle of salt if you like. Cut into quarters.STEP 5To serve, ladle thecreamytomatobeansinto bowls, top with the blisteredcherrytomatoesand drizzle over thegremolatadressing. Serve the flatbread alongside and use them to scoop it all up. Enjoy!What’s in your boxCreamy Tomato SauceCherry TomatoesGremolataBaby SpinachButterbeansGarlic & Herb FlatbreadNutritional infoAll nutritional values are based on a per person scale.Calories726kcalTotal fat25.1gSaturated fat2.5gSalt2.3gTotal carbohydrate92gTotal sugar10.8gFibre19gProtein30.6gIngredients / AllergensSilken tofu (soybeans, nigari), red pepper, sundried tomatoes, smoked sweet paprika, tomato purée, garlic, onion powder, water, soy milk (soybeans, water), chilli flakes, sea salt, almonds (nuts), capers, basil, fresh lemon juice, nutritional yeast, extra virgin olive oil, rapeseed oil, cherry tomatoes on the vine, baby spinach, butter beans, garlic & herb flatbread (wheat flour (gluten), salt, yeast, vegetable oil, garlic, mixed herbs)For allergens, see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 726.0,
      "protein_g": 30.6,
      "fat_g": 25.1,
      "carbs_g": 92.0,
      "fibre_g": 19.0,
      "salt_g": 2.3
    }
  },
  {
    "id": "creamy-tomato-daal",
    "title": "Creamy Tomato Daal With Charred Cauliflower, Crispy Kale, Coconut Yoghurt & Fluffy Rice",
    "source_url": "https://planthood.co.uk/products/creamy-tomato-daal",
    "week_label": null,
    "weeks": [
      "Nov 24, 2025"
    ],
    "category": "Nourish",
    "ingredients": [],
    "method": "Creamy Tomato Daal With Charred Cauliflower, Crispy Kale, Coconut Yoghurt & Fluffy RiceOur rich and creamy tomato daal is a flavour sensation and nutritional powerhouse. It's gently spiced with a blend of spices and crowned with charred cauliflower bites, crispy salted kale and served alongside fluffy basmati rice. This delicious bowl of goodness will nourish you from the inside out.Prep time2Total time15Cooking Mode:\nCooking instructionsPlease note: due to supplier availability and seasonality you may receive whole head cauliflower or florets.Before you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Preheat your oven to 200°C / 220°C fan, then take out a large roasting tray and two saucepans.STEP 2Cut thecauliflowerinto bitesized chunks, place into your roasting tray and toss with olive oil, salt and pepper. Roast for 15-20 minutes or until tender in the centre and nicely charred on the outside.STEP 3Empty thetomatodaalsauceinto your saucepan along with thered lentilsand 250ml of water. Cook the daal over a medium heat for around until the lentils are tender and cooked through, around 10-15 minutes. Stir regularly to stop the lentils from sticking to the bottom of the pan. Once cooked, squeeze in half of thelimeand season to taste with salt.STEP 4Place thericein a small saucepan and cover with 2.5x its volume in water. Bring to the boil, then reduce the heat and cover. Cook for 8-10 minutes or until the rice is tender, but al dente.STEP 5Remove any hardy stems from thecavolonero, then finely slice the leaves. Once there is 10 minutes left on the roasted cauliflower, add the sliced cavolo nero to one side of the roasting tray, toss in a little olive oil and some salt and roast for the final 10 minutes of cooking time. Check the cavolo nero after 5 minutes to make sure it doesn't burn. Meanwhile roughly chop thecorianderleaves.STEP 6Divide thetomatodaalandricebetween serving bowls, then top with the charredcauliflower, crispycavoloneroand a dollop ofcoconutyoghurt. Garnish with choppedcoriander, the rest of thelimejuice and enjoy!What’s in your boxTomato Daal SauceCoconut YoghurtRed LentilsCavolo NeroCauliflowerCorianderLimeBasmati RiceNutritional infoAll nutritional values are based on a per person scale.Calories638kcalTotal fat22.2gSaturated fat17.7gSalt0.25gTotal carbohydrate93.1gTotal sugarFibre34.7gProtein28.5gIngredients / AllergensRed lentils, cauliflower, basmati rice, cavolo nero, fresh coriander, onion, garlic, ginger, madras curry powder (ground coriander, ground turmeric,mustardpowder, bengal gram (black chickpea), ground cumin, ground chilli, ground fenugreek, ground black pepper, garlic powder, iodised salt, ground fennel.), cumin, garam masala (coriander, cinnamon, cloves, ginger, star anise, cumin, chilli, fennel, black pepper, bay leaves, sunflower oil, nutmeg, cardamom), chilli flakes, tomatoes, coconut milk, sea salt, coconut yoghurt, limeFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 638.0,
      "protein_g": 28.5,
      "fat_g": 22.2,
      "carbs_g": 93.1,
      "fibre_g": 34.7,
      "salt_g": 0.25
    }
  },
  {
    "id": "creamy-vietnamese-coconut-curry-with-tofu-sweet-potato-crispy-shallots-pickled-radish-cashews-sesame-seeds",
    "title": "Creamy Vietnamese Coconut Curry With Tofu, Sweet Potato, Crispy Shallots, Pickled Radish, Cashews & Sesame Seeds",
    "source_url": "https://planthood.co.uk/products/creamy-vietnamese-coconut-curry-with-tofu-sweet-potato-crispy-shallots-pickled-radish-cashews-sesame-seeds",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Creamy Vietnamese Coconut Curry With Tofu, Sweet Potato, Crispy Shallots, Pickled Radish, Cashews & Sesame SeedsPrep timeTotal timeCooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.CaloriesTotal fatSaturated fatSaltTotal carbohydrateTotal sugarFibreProteinIngredients / Allergens",
    "nutrition": {}
  },
  {
    "id": "crispy-baja-tofish-tacos-with-shredded-cabbage-salsa-fresca-smokey-chipotle-mayo",
    "title": "Crispy Baja Tofish Tacos With Shredded Cabbage, Zingy Salsa Fresca & Smokey Chipotle Mayo On Soft Corn Tortillas",
    "source_url": "https://planthood.co.uk/products/crispy-baja-tofish-tacos-with-shredded-cabbage-salsa-fresca-smokey-chipotle-mayo",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Crispy Baja Tofish Tacos With Shredded Cabbage, Zingy Salsa Fresca & Smokey Chipotle Mayo On Soft Corn TortillasFreshly made soft corn tacos loaded with nori-wrapped crispy tofish fillets, crunchy shredded lettuce, zingy jalapeño-spiked salsa fresca, smokey chipotle mayo and a squeeze of fresh lime. Sunny, al fresco handfuls of heaven.Prep timeTotal timeCooking Mode:\nCooking instructionsFreshly made soft corn tacos loaded with nori-wrapped crispy tofish fillets, crunchy shredded lettuce, zingy jalapeño-spiked salsa fresca, smokey chipotle mayo and a squeeze of fresh lime. Sunny, al fresco handfuls of heaven.NutritionCalories 657kcal; Protein 14.4g; Fat 36.3g; Saturated Fat 6.6g; Total Carbs 73.9g; Fibre 9g; Salt 1gIngredientsTofu (soyabeans, water, nigari),soymilk, chipotle paste (chipotle chillies, water, tomato puree, salt, sugar, onion, acetic acid), vegetable oil, apple cider vinegar, raw natural cane sugar, jalapenos, coriander, red onion, extra virgin olive oil, plum tomatoes, white cabbage, white wine vinegar, white corn tortillas (masa harina (ground nixtamialized corn), water, sea salt), limeAllergensSoyPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories657kcalTotal fat36.3gSaturated fat6.6gSalt1gTotal carbohydrate73.9gTotal sugarFibre9gProtein14.4gIngredients / AllergensTofu (soyabeans, water, nigari),soymilk, chipotle paste (chipotle chillies, water, tomato puree, salt, sugar, onion, acetic acid), vegetable oil, apple cider vinegar, raw natural cane sugar, jalapenos, coriander, red onion, extra virgin olive oil, plum tomatoes, white cabbage, white wine vinegar, white corn tortillas (masa harina (ground nixtamialized corn), water, sea salt), limeAllergensSoyPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 657.0,
      "protein_g": 14.4,
      "fat_g": 36.3,
      "carbs_g": 73.9,
      "fibre_g": 9.0,
      "salt_g": 1.0
    }
  },
  {
    "id": "crispy-buffalo-tofu-tacos-with-cooling-ranch-dressing-shredded-cabbage-pineapple-salsa",
    "title": "Crispy Buffalo Tofu Tacos With Cooling Ranch Dressing, Shredded Cabbage & Juicy Pineapple",
    "source_url": "https://planthood.co.uk/products/crispy-buffalo-tofu-tacos-with-cooling-ranch-dressing-shredded-cabbage-pineapple-salsa",
    "week_label": null,
    "weeks": [
      "Nov 17, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Crispy Buffalo Tofu Tacos With Cooling Ranch Dressing, Shredded Cabbage & Juicy PineappleFreshly baked soft corn tortillas filled with crispy tofu smothered in a zingy buffalo sauce. Finished with cooling cashew ranch dressing, shredded red cabbage, juicy pineapple and fresh coriander. These little handfuls of heaven are filled to the brim with fresh and vibrant flavours.Prep time3Total time15Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1All you need to finish this dish is a large frying pan.STEP 2Tear thetofuinto bite-sized chunks with your hands, then place into a small bowl with thecornflourand season well with salt and pepper. Mix carefully with your hands to coat the tofu in the cornflour. Add a drizzle of oil to your frying pan and place over a medium-high heat. Once hot, add the tofu and fry on all sides until golden and crispy. Alternatively, toss in a little oil and air fry for 15 minutes, tossing every 5 minutes.STEP 3Meanwhile slice thered cabbageas thinly as you can (use a mandolin if you have one). Roughly chop thecoriander. Roughly chop thepineappleinto smaller pieces. Give thecashew ranch saucea shake in its pouch before opening in case it has separated while sitting in the fridge.STEP 4When the tofu is ready, remove it from the pan and place it into a bowl and toss with thebuffalo sauceto coat evenly. You may want to run the sauce pouch under warm water to loosen the texture before opening.STEP 5Wipe your frying pan clean with some kitchen towel, then dry-fry thetacos(without oil) for 10–20 seconds on each side, or until warm and soft. Add a sprinkle of water if you’d like them extra soft.STEP 6Divide the tacos between serving plates, then pile up with the crispybuffalotofu, a drizzle ofcashewranchsauce, theredcabbageandpineapple. Finish with a scattering ofcorianderto garnish and enjoy!What’s in your boxCorn TacosOrganic TofuBuffalo Hot SauceCashew Ranch SaucePineappleCorianderRed CabbageCornflourNutritional infoAll nutritional values are based on a per person scale.Calories453kcalTotal fat17.2gSaturated fat4.6gSalt1.25gTotal carbohydrate48.1gTotal sugar12gFibre7.4gProtein23.4gIngredients / AllergensCorn tortillas (yellow corn flour), cornflour, organic tofu (soybeans, water, nigari), distilled vinegar, aged cayenne red peppers, salt, water, canola oil, paprika, garlic powder, coconut oil, raw organic agave nectar, sea salt, vegan labneh (spring water, cashews (nuts), coconut oil, pink salt, garlic, live culture), cashews (nuts), soy milk (soybeans, water), fresh lemon juice, fresh lime juice, garlic powder, onion powder, black pepper, parsley, pineapple, red cabbage, fresh corianderFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 453.0,
      "protein_g": 23.4,
      "fat_g": 17.2,
      "carbs_g": 48.1,
      "fibre_g": 7.4,
      "salt_g": 1.25
    }
  },
  {
    "id": "crispy-buffalo-tofu-wrap-with-creamy-cashew-blue-cheese-ranch-sauce-avocado-cabbage-carrot-slaw",
    "title": "Crispy Buffalo Tofu Wrap With Creamy Cashew Blue 'Cheese' Ranch Sauce, Avocado & Rainbow Slaw",
    "source_url": "https://planthood.co.uk/products/crispy-buffalo-tofu-wrap-with-creamy-cashew-blue-cheese-ranch-sauce-avocado-cabbage-carrot-slaw",
    "week_label": null,
    "weeks": [
      "Oct 27, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Crispy Buffalo Tofu Wrap With Creamy Cashew Blue 'Cheese' Ranch Sauce, Avocado & Rainbow SlawIf you love the flavours of hot buffalo and blue cheese sauce, now you can enjoy it made entirely with healthy 100% whole food plant-based ingredients. Crispy chicken-like tofu pieces are smothered in our zingy buffalo sauce, followed by a cooling blue 'cheese' style ranch dressing made from a base of gut-healthy fermented cashews. It's fully loaded in a giant 12\" wrap with avocado for healthy fats and crunchy red cabbage and carrot slaw. It looks light, but it's packed with 30g protein and 1/2 your daily fibre intake, so will leave you feeling full, satisfied and full of energy!Prep time5Total time15Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1All you need to finish this dish is a large frying pan.STEP 2Tear thetofuinto bite-sized chunks with your hands, then place into a small bowl with thecornflourand season well with salt and pepper. Mix carefully with your hands to coat the tofu in the cornflour. Add a drizzle of oil to your frying pan and place over a medium-high heat. Once hot, add the tofu and fry on all sides until golden and crispy. Alternatively, toss in a little oil and air fry for 15 minutes, tossing every 5 minutes.STEP 3Meanwhile, slice thered cabbageas thinly as you can and julienne thecarrot(use a mandolin if you have one). Remove the stone and skin from theavocadoand thinly slice it. Give thecashew ranch saucea shake in its pouch before opening, in case it has separated while sitting in the fridge.STEP 4When the tofu is ready, remove it from the pan and place it into a bowl and toss with thebuffalo sauceto coat evenly. You may want to run the sauce pouch under warm water to loosen the texture before opening.STEP 5Wipe your frying pan clean with some kitchen towel, then dry-fry theflour tortillas(without oil) for 10–20 seconds on each side, or until warm and soft.STEP 6To serve, place aflour tortillaon each serving plate, then add the slicedred cabbageand juliennedcarrotto the bottom half. Top with thecrispy buffalo tofuand slicedavocado, then drizzle over thecashew ranch sauce. Fold the sides of the tortilla toward the centre, roll it up tightly from the bottom, and enjoy!What’s in your boxBuffalo Hot SauceCashew Ranch SauceOrganic TofuTortilla WrapAvocadoCarrotRed CabbageCornflourNutritional infoAll nutritional values are based on a per person scale.Calories737kcalTotal fat36.9gSaturated fat9.7gSalt2.4gTotal carbohydrate76.9gTotal sugar13.4gFibre15.4gProtein30.2gIngredients / AllergensOrganic tofu (soybeans, water, nigari), carrot, cabbage, avocado, distilled vinegar, aged cayenne red peppers, salt, water, canola oil, paprika, garlic powder, coconut oil, raw organic agave nectar, sea salt, vegan labneh (spring water, cashews (nuts), coconut oil, pink salt, garlic, live culture), cashews (nuts), soy milk (soy beans, water), fresh lemon juice, fresh lime juice, garlic powder, onion powder, black pepper, parsley, tortilla wrap (wheat flour, water, sea salt, calcium carbonate, calcium propionate, iron, niacin, thiamin)For allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 737.0,
      "protein_g": 30.2,
      "fat_g": 36.9,
      "carbs_g": 76.9,
      "fibre_g": 15.4,
      "salt_g": 2.4
    }
  },
  {
    "id": "crispy-cauliflower-gnocchi-with-puttanesca-sauce-crispy-kale-fresh-parsley",
    "title": "Crispy Cauliflower Gnocchi With Puttanesca Sauce, Crispy Kale & Fresh Parsley",
    "source_url": "https://planthood.co.uk/products/crispy-cauliflower-gnocchi-with-puttanesca-sauce-crispy-kale-fresh-parsley",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Crispy Cauliflower Gnocchi With Puttanesca Sauce, Crispy Kale & Fresh ParsleyPrep timeTotal timeCooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.CaloriesTotal fatSaturated fatSaltTotal carbohydrateTotal sugarFibreProteinIngredients / Allergens",
    "nutrition": {}
  },
  {
    "id": "crispy-chipotle-pumpkin-black-bean-tacos-with-melted-mozzarella-guacamole-pink-onion-pickles",
    "title": "Crispy Chipotle Pumpkin & Black Bean Tacos With Melted 'Mozzarella', Guacamole & Pink Onion Pickles",
    "source_url": "https://planthood.co.uk/products/crispy-chipotle-pumpkin-black-bean-tacos-with-melted-mozzarella-guacamole-pink-onion-pickles",
    "week_label": null,
    "weeks": [
      "Dec 01, 2025"
    ],
    "category": null,
    "ingredients": [],
    "method": "Crispy Chipotle Pumpkin & Black Bean Tacos With Melted 'Mozzarella', Guacamole & Pink Onion PicklesThis delicious stuffed taco recipe is our latest obsession. Soft tortillas are filled with chipotle spiced pumpkin, black beans and mozzarella then fried until crispy on the outside and oozing in the centre. Served with creamy guacamole and zingy pink pickled onions. Every mouthful is a guaranteed flavour bomb!Prep time10Total time15Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Finely slice theredonionand place into a small bowl. If it’s a large onion, half for two people will work well. Squeeze over half of thelimeand season with salt. Give the onions a quick mix and leave to pickle while you make the tacos.STEP 2Drain theblackbeansand add to a  small-medium sized bowl. Mash them up with a potato masher or fork until you have a chunky paste that binds together more, then stir through thechipotle pumpkin sauceand the zest of half thelime. Season with salt and pepper.Finely grate theplant-basedmozzarella.STEP 3Wrap the corn tortillas in a damp paper towel and microwave for about 30 seconds. This makes them more pliable and prevents cracking or breaking when folding. If you don’t have a microwave you could warm each tortilla in a frying pan without oil for 20 seconds before filling it.To fill the tacos, spread some of thechipotle pumpkin and black bean mixonto each of thetacosleaving 0.5cm of space around the edge. Divide themozzarellabetween them all, then fold them over in half. Add a drizzle of oil to your frying pan and place over a medium heat. Once hot, fry the tacos for around 2 minutes on each side, or until golden and crispy. You may need to cook them in batches.STEP 4Make your guacamole while the tacos cook. Pit theavocadoand finely chop thecoriander. Place theavocadointo a small bowl and mash it up with a fork. Add half of thecoriander, the remaining half oflimejuice and season well with salt. You could also add a drizzle of extra virgin olive oil.STEP 5To serve up, divide thetacosbetween serving bowls, serve theguacamoleandpicklesalongside and garnish with the remainingcoriander. We recommend scooping a little guac and pickles onto the tacos as you eat them. Enjoy!What’s in your boxChipotle Pumpkin SauceAvocadoCorianderVegan MozzarellaBlack BeansCorn TacosLimeRed OnionNutritional infoAll nutritional values are based on a per person scale.Calories571kcalTotal fat19.7gSaturated fat7.7gSalt0.9gTotal carbohydrate85.8gTotal sugar14.9gFibre21.1gProtein20.1gIngredients / AllergensPumpkin, red onion, garlic, smoked paprika, ground coriander, ground cumin, cinnamon, cloves, oregano, tomato puree, raw organic agave nectar, chipotle, balsamic vinegar (sulphites), water, sea salt, black beans, corn tortillas (water, yellow corn flour), avocado, lime, coriander, plant-based mozzarella (soymilk (water,soybeans), coconut oil, tapioca flour, sea salt, kappa carageenan (derived from seaweed), nutritional yeast, lactic acid)",
    "nutrition": {
      "calories": 571.0,
      "protein_g": 20.1,
      "fat_g": 19.7,
      "carbs_g": 85.8,
      "fibre_g": 21.1,
      "salt_g": 0.9
    }
  },
  {
    "id": "crispy-courgette-sweetcorn-fritters-with-garlic-dill-yoghurt-and-sweet-cucumber-pickle",
    "title": "Crispy Courgette & Sweetcorn Fritters With Garlic & Dill Yoghurt and Sweet Cucumber Pickle",
    "source_url": "https://planthood.co.uk/products/crispy-courgette-sweetcorn-fritters-with-garlic-dill-yoghurt-and-sweet-cucumber-pickle",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Crispy Courgette & Sweetcorn Fritters With Garlic & Dill Yoghurt and Sweet Cucumber PickleCrispy on the outside and full of flavour on the inside, these delicious fritters are packed with big juicy corn kernels, courgettes and lots of spice. All topped with sweet cucumber pickle, a lip smacking garlic and dill yoghurt and a squeeze of fresh lemon to brighten up all the flavours.Prep timeTotal timeCooking Mode:\nCooking instructionsCrispy on the outside and full of flavour on the inside, these delicious fritters are packed with big juicy corn kernels, courgettes and lots of spice. All topped with sweet cucumber pickle, a lip smacking garlic and dill yoghurt and a squeeze of fresh lemon to brighten up all the flavours.NutritionCalories 484kcal; Protein 19.3g; Fat 4.7g; Saturated Fat 1.1g; Total Carbs 101.1g; Fibre 12g; Salt 0.5gIngredientsCourgette, sweetcorn, spring onions, gluten free flour, sweet smoked paprika, ground garlic, chilli flakes, baking powder, brownmustardseeds, cucumber, rice vinegar, raw natural cane sugar, sea salt, water, lemon,soyyoghurt (soya beans, water, selected live cultures (bifidus, acidophilus)), pectin, minerals (calcium carbonate, calcium phosphate, potassium iodide), dill, sea salt, vitamins (D2, B12)AllergensFor allergens, please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories484kcalTotal fat4.7gSaturated fat1.1gSalt0.5gTotal carbohydrate101.1gTotal sugarFibre12gProtein19.3gIngredients / AllergensCourgette, sweetcorn, spring onions, gluten free flour, sweet smoked paprika, ground garlic, chilli flakes, baking powder, brownmustardseeds, cucumber, rice vinegar, raw natural cane sugar, sea salt, water, lemon,soyyoghurt (soya beans, water, selected live cultures (bifidus, acidophilus)), pectin, minerals (calcium carbonate, calcium phosphate, potassium iodide), dill, sea salt, vitamins (D2, B12)AllergensFor allergens, please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 484.0,
      "protein_g": 19.3,
      "fat_g": 4.7,
      "carbs_g": 101.1,
      "fibre_g": 12.0,
      "salt_g": 0.5
    }
  },
  {
    "id": "crispy-gochujang-cauliflower-with-vermicelli-noodles-spring-onion",
    "title": "Crispy Gochujang Cauliflower With Edamame, Julienned Vegetables & Vermicelli Noodles",
    "source_url": "https://planthood.co.uk/products/crispy-gochujang-cauliflower-with-vermicelli-noodles-spring-onion",
    "week_label": null,
    "weeks": [],
    "category": null,
    "ingredients": [],
    "method": "Crispy Gochujang Cauliflower With Edamame, Julienned Vegetables & Vermicelli NoodlesCrispy cauliflower bites are the highlight of this dish, drenched in an addictive spicy, umami-flavoured gochujang sauce, then tossed through gluten-free vermicelli glass noodles with shredded cabbage, julienned carrot, edamame beans and freshly sliced spring onions.Prep timeTotal timeCooking Mode:\nCooking instructionsCrispy cauliflower bites are the highlight of this dish, drenched in an addictive spicy, umami-flavoured gochujang sauce, then tossed through gluten-free vermicelli glass noodles with shredded cabbage, julienned carrot, edamame beans and freshly sliced spring onions.NutritionCalories 665kcal; Protein 19.6g; Fat 13.5g; Saturated Fat 1.8g; Total Carbs 120g; Fibre 15.4g; Salt 2gIngredientsCarrot, red cabbage, cauliflower, edamame, vegan boullion (celery), dijonmustard, maple syrup, sesame oil, gochujang (water, brown rice, red pepper powder, salt, alcohol,soybean, garlic, onion, tapioca syrup), rice vinegar, whitesesameseeds,vermicelli noodles, spring onionAllergensSoy, mustard, celery, sesamePlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories665kcalTotal fat13.5gSaturated fat1.8gSalt2gTotal carbohydrate120gTotal sugarFibre15.4gProtein19.6gIngredients / AllergensCarrot, red cabbage, cauliflower, edamame, vegan boullion (celery), dijonmustard, maple syrup, sesame oil, gochujang (water, brown rice, red pepper powder, salt, alcohol,soybean, garlic, onion, tapioca syrup), rice vinegar, whitesesameseeds,vermicelli noodles, spring onionAllergensSoy, mustard, celery, sesamePlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 665.0,
]
