[
  {
    "id": "tandoori-tofu-with-pickled-red-cabbage-minted-oat-yoghurt-fresh-spinach-wrapped-in-soft-naan",
    "title": "Tandoori Tofu Naan Wraps With Cooling Mint Yoghurt, Pickled Red Cabbage & Fresh Spinach",
    "source_url": "https://planthood.co.uk/products/tandoori-tofu-with-pickled-red-cabbage-minted-oat-yoghurt-fresh-spinach-wrapped-in-soft-naan",
    "week_label": null,
    "category": null,
    "ingredients": [],
    "method": "Tandoori Tofu Naan Wraps With Cooling Mint Yoghurt, Pickled Red Cabbage & Fresh SpinachOur tandoori tofu wrap is a flavour sensation! Tender tofu bites are tossed in a tandoori marinade made with garlic, ginger, lemon and spices, roasted until charred, then smothered in a cool minted yoghurt, tangy pickled red cabbage and fresh spinach. All wrapped in a freshly baked, pillowy soft garlic and herb naan.Prep timeTotal timeCooking Mode:\nCooking instructionsOur tandoori tofu wrap is a flavour sensation! Tender tofu bites are tossed in a tandoori marinade made with garlic, ginger, lemon and spices, roasted until charred, then smothered in a cool minted yoghurt, tangy pickled red cabbage and fresh spinach. All wrapped in a freshly baked, pillowy soft garlic and herb naan.NutritionCalories 513kcal; Protein 22.8g; Fat 24.3g; Saturated Fat 5.5g; Total Carbs 56.2g; Fibre 7.2g; Salt 1.4gIngredientsGarlic, ginger, paprika, salt, ground cumin, cayenne pepper, ground ginger, ground coriander, turmeric, maple syrup, lemon juice, tofu(soy), red onion, red wine vinegar, water, raw natural cane sugar, blackmustardseeds, fennel seeds, coriander seeds, mint, spinach, flatbread (sesame,wheatflour, water, salt, vegetable oil), oat yoghurt (water, oats, rapeseed oil, potato starch, potato protein, acids (malic acid, lactic acid), stabiliser (pectin), minerals (calcium carbonate, calcium phosphate, potassium iodide), salt, vitamins (D2 and B12))Please be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESAllergensSoy, mustard, wheat, sesamePlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories513kcalTotal fat24.3gSaturated fat5.5gSalt1.4gTotal carbohydrate56.2gTotal sugarFibre7.2gProtein22.8gIngredients / AllergensGarlic, ginger, paprika, salt, ground cumin, cayenne pepper, ground ginger, ground coriander, turmeric, maple syrup, lemon juice, tofu (soy), red onion, red wine vinegar, water, raw natural cane sugar, blackmustardseeds, fennel seeds, coriander seeds, mint, spinach, flatbread (sesame,wheatflour, water, salt, vegetable oil), oat yoghurt (water, oats, rapeseed oil, potato starch, potato protein, acids (malic acid, lactic acid), stabiliser (pectin), minerals (calcium carbonate, calcium phosphate, potassium iodide), salt, vitamins (D2 and B12))Please be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESAllergensSoy, mustard, wheat, sesamePlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 513.0,
      "protein_g": 22.8,
      "fat_g": 24.3,
      "carbs_g": 56.2,
      "fibre_g": 7.2,
      "salt_g": 1.4
    }
  },
  {
    "id": "creamy-kimchi-macaroni-with-roasted-broccoli-garlic-panko-breadcrumbs",
    "title": "Creamy Kimchi Macaroni With Roasted Broccoli & Garlic Panko Breadcrumbs",
    "source_url": "https://planthood.co.uk/products/creamy-kimchi-macaroni-with-roasted-broccoli-garlic-panko-breadcrumbs",
    "week_label": null,
    "category": null,
    "ingredients": [],
    "method": "Creamy Kimchi Macaroni With Roasted Broccoli & Garlic Panko BreadcrumbsThis creamy, umami packed macaroni is an updated, Korean inspired, healthy version of a nostalgic classic. Kimchi not only adds tonnes of flavour but is great for your gut microbiome too. The crispy, garlicky breadcrumbs and the roasted broccoli add even more layers of flavour and texture. It’s comfort food at its best.Prep time1Total time10Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Boil your kettle and preheat your oven to 200°C / 180°C fan. Take out a large saucepan, a small frying pan and a roasting tray.STEP 2Cut thebroccoliinto bite-sized pieces. Lay them on a baking tray in a single layer with a drizzle of olive oil and season with salt and pepper. Roast for 10-15 mins until golden, tossing once.STEP 3Pour boiling water into your saucepan, add themacaronipasta, then place over the heat and salt the water well. Boil the pasta for 8 minutes or until al dente. Scoop out a mug of pasta water, then drain and return the pasta to the pan.STEP 4Place your frying pan over medium heat, and dry fry (without oil) thegarlic breadcrumbsmix until lightly toasted. Finely chop thespringonionand keep the white half separate from the green. Chop thevegan kimchiinto smaller bite-sized pieces (don’t throw away the juices as they’re packed with flavour and probiotics!).STEP 5Add thegochujang 'cheese' sauce,springonionwhites, andkimchito the pot with themacaroniand stir to heat through. Add a few splashes of pasta water as needed to make the sauce silky. Add the cookedbroccoliand stir again until just combined.STEP 6To serve, ladle the creamymacaroniinto bowls and top with the crispygarlic breadcrumbsand thespringoniongreens. Enjoy!(NB: If saving some for leftovers, heat it with a splash of vegan milk, reserved pasta water or water, as the pasta will absorb a lot of the sauce as it sits)What’s in your boxGochujang 'Cheese' SauceBroccoliVegan KimchiGarlic BreadcrumbsMacaroniSpring OnionsNutritional infoAll nutritional values are based on a per person scale.Calories767kcalTotal fat24.6Saturated fat4.8Salt2.4gTotal carbohydrate116gTotal sugarFibre11.6gProtein29.1gIngredients / AllergensBroccoli, spring onion, cashews (nuts), carrot juice, gluten freesoysauce, soy milk (soybeans), nutritional yeast, garlic powder, onion powder, rice vinegar, white miso (soybeans, rice, salt, yeast, koji culture), raw organic agave nectar, gochujang (tapioca, brown rice, red pepper powder, salt, alcohol,soybeans, garlic, onion), fresh lemon juice, sea salt, panko breadcrumbs (gluten), crispy fried garlic, gochugaru chilli flakes, vegan kimchi (cabbage, carrot, daikon, spring onion, apple, chilli, tamari (soybeans, salt), chilli powder, ginger, garlic, salt, vegan cultures), macaroni (gluten)For allergens, please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 767.0,
      "protein_g": 29.1,
      "carbs_g": 116.0,
      "fibre_g": 11.6,
      "salt_g": 2.4
    }
  },
  {
    "id": "peanut-butter-curry-with-sweet-potato-tenderstem-broccoli-crushed-peanuts-chilli-lime",
    "title": "Peanut Butter Curry With Charred Red Peppers, Sugar Snap Peas, Lime & Toasted Peanuts",
    "source_url": "https://planthood.co.uk/products/peanut-butter-curry-with-sweet-potato-tenderstem-broccoli-crushed-peanuts-chilli-lime",
    "week_label": null,
    "category": null,
    "ingredients": [],
    "method": "Peanut Butter Curry With Charred Red Peppers, Sugar Snap Peas, Lime & Toasted PeanutsA rich and fragrant Thai-inspired curry, gently cooked in coconut milk with lemongrass, garlic, ginger, spices and a swirl of creamy peanut butter for added depth and richness. Filled with a medley of vegetables like charred red peppers, sugar snap peas and new potatoes. Finished with a squeeze of zingy fresh lime, toasted crushed peanuts and served with basmati rice.Prep timeTotal timeCooking Mode:\nCooking instructionsA rich and fragrant Thai-inspired curry, gently cooked in coconut milk with lemongrass, garlic, ginger, spices and a swirl of creamy peanut butter for added depth and richness. Filled with a medley of vegetables like charred red peppers, sugar snap peas and new potatoes. Finished with a squeeze of zingy fresh lime, toasted crushed peanuts and served with basmati rice.NutritionCalories 695kcal; Protein 22.7g; Fat 31.1g; Saturated Fat 21.3g; Total Carbs 107.8g; Fibre 12.2g; Salt 1.25gIngredientsGarlic, ginger, red chilli, lemongrass, cumin, coriander, cloves, cinnamon, nutmeg, onion, carrot, new potato, coconut milk, water, vegan bouillon (celery),peanutbutter,soysauce, sugar snap peas, red pepper, lime,peanuts, basmati riceAllergensPeanuts, celery, soyPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories695kcalTotal fat31.1gSaturated fat21.3gSalt1.25gTotal carbohydrate107.8gTotal sugarFibre12.2gProtein22.7gIngredients / AllergensGarlic, ginger, red chilli, lemongrass, cumin, coriander, cloves, cinnamon, nutmeg, onion, carrot, new potato, coconut milk, water, vegan bouillon (celery),peanutbutter,soysauce, sugar snap peas, red pepper, lime,peanuts, basmati riceAllergensPeanuts, celery, soyPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 695.0,
      "protein_g": 22.7,
      "fat_g": 31.1,
      "carbs_g": 107.8,
      "fibre_g": 12.2,
      "salt_g": 1.25
    }
  },
  {
    "id": "tahini-miso-ramen-with-crispy-chilli-tempeh-pak-choi-gluten-free-brown-rice-noodles",
    "title": "Tahini Miso Ramen With Crispy Chilli Tempeh, Pak Choi & Flat Rice Noodles",
    "source_url": "https://planthood.co.uk/products/tahini-miso-ramen-with-crispy-chilli-tempeh-pak-choi-gluten-free-brown-rice-noodles",
    "week_label": null,
    "category": null,
    "ingredients": [],
    "method": "Tahini Miso Ramen With Crispy Chilli Tempeh, Pak Choi & Flat Rice NoodlesOur rich and flavoursome ramen broth is slowly cooked with shiitake, miso, ginger and kombu and finished with a swirl of premium quality creamy tahini. It's topped with crispy ground tempeh tossed in an umami-rich chilli sauce, tender pak choi and served with gluten-free rice noodles. All finished with a chilli and spring onion garnish.Prep timeTotal timeCooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Boil your kettle, then take out a large frying pan and two saucepans.STEP 2Crumble thetempehwith your hands until minced. Remove thepakchoileaves from the base of the stem using your hands. Finely dice thechilliandspringonions(including the green bits!).STEP 3Place your frying pan over high heat and add a generous drizzle of oil. Add the crumbledtempehto your frying pan and fry until crispy, around 5 minutes. Stir through half of theblackbeanrayu, then remove from the pan and keep warm.STEP 4Pour boiling water from your kettle into your first saucepan and place over a medium-high heat. Once the water is bubbling, add theflat ricenoodlesand cook for 4-5 minutes or until tender but al dente. Keep checking as rice noodles can be easily overcooked. Drain and rinse well under cold running water, then leave them in a colander to drain.STEP 5Meanwhile, pour themiso tahini brothinto your other saucepan and add 300ml of water (double the measurement for a four person portion size). Place it over medium-high heat and bring it to a boil, then reduce the heat to a light simmer until ready to serve.STEP 6Wipe clean the same frying pan you used to cook the tempeh with kitchen towel, then add thepakchoiand cook until tender, around 5 minutes (you can do this step while you serve up the rest of the ramen as below).STEP 7To serve up, divide thenoodlesbetween serving bowls, pour over the hotmisotahinibroth, then top with thepakchoiand chillitempeh. Garnish withchilli,springonionsand a drizzle of the remainingblack bean rayu. Enjoy!What’s in your boxMiso Tahini Ramen BrothBlack Bean RayuOrganic TempehPak ChoiFlat Rice NoodlesRed ChilliSpring OnionsNutritional infoAll nutritional values are based on a per person scale.Calories650kcalTotal fat37.9gSaturated fat6.5gSalt3.8gTotal carbohydrate62.1gTotal sugarFibre7gProtein29gIngredients / AllergensPak choi, red chilli, spring onions, dried shiitake mushrooms, ginger, garlic, kombu, white miso (water,soybeans, rice, salt), gluten free low sodiumsoysauce, tahini (sesame), rice noodles (rice flour, water), sesame oil (sesame), organic raw agave nectar, tempeh (soybeans, water, tempeh culture (gluten-free rice flour*, inoculum)), salted fermented blacksoybeans, rapeseed oil, sichuan peppercorns, raw natural cane sugar, blacksesameseeds, cinnamon, star anise, rice vinegarFor allergens, please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 650.0,
      "protein_g": 29.0,
      "fat_g": 37.9,
      "carbs_g": 62.1,
      "fibre_g": 7.0,
      "salt_g": 3.8
    }
  },
  {
    "id": "adobo-black-beans-with-shredded-lettuce-lime-cashew-crema-avocado-salsa-macha",
    "title": "Adobo Black Bean Tostadas With Shredded Lettuce, Lime Cashew Crema, Avocado & Salsa Macha",
    "source_url": "https://planthood.co.uk/products/adobo-black-beans-with-shredded-lettuce-lime-cashew-crema-avocado-salsa-macha",
    "week_label": null,
    "category": null,
    "ingredients": [],
    "method": "Adobo Black Bean Tostadas With Shredded Lettuce, Lime Cashew Crema, Avocado & Salsa MachaOur smokey, slow-cooked black beans are layered with a multitude of complex flavours like cumin, paprika and ancho chillies, served on crispy corn tostadas and topped with crisp shredded lettuce and creamy avocado. Finished with a zingy lime cashew crema and our house made salsa macha featuring crushed peanuts and three types of Mexican chillies.Prep time2Total time10Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Take out a saucepan and preheat your oven to 200°C / 180°C fan.STEP 2Traditionally tostadas are shallow fried in oil for 30 seconds on each side, which you can do if you want them to turn really crispy. However for our healthier, oil-free version, simply pop thetacosonto a baking tray with space in between them and bake for 8 minutes or until crispy, flipping half way.STEP 3Drain theblackbeansand empty into your saucepan along with thesmoky adobo sauce, place over a medium heat and warm through, stirring occasionally, until piping hot, around 5 minutes. Add a splash of water if it starts to stick at the bottom. Roughly mash around half of the beans with a fork and set aside.STEP 4Finely shred thebabygemby cutting horizontally across the head. De-stone theavocadoand cut into thin slices flat side down. If you're feeling fancy you could fan the avocado for a more elevated final presentation. Using the palm of your hand, carefully push the avocado down and away from yourself to open it up like a fan without the slices breaking. Cut thelimeinto wedges.STEP 5Lay everything out on your table and then start building your tostadas. Start with a layer ofblackbeans, then shreddedlettuce, dress the lettuce with a drizzle ofcashewcrema, top with some slices ofavocadoand a final drizzle ofsalsamacha. Finish with a squeeze of freshlimejuice, and enjoy!What’s in your boxSmoky Adobo SauceBlack BeansSalsa MachaFreshly Baked TacosCashew CremaBaby Gem LettuceAvocadoLimeNutritional infoAll nutritional values are based on a per person scale.Calories753kcalTotal fat48.4gSaturated fat8.3gSalt1.5gTotal carbohydrate64.9gTotal sugar13gFibre19.4gProtein21.3gIngredients / AllergensBlack beans, red onion, garlic, cumin, smoked sweet paprika, ground coriander, cinnamon, clove, oregano, tomato purée, raw organic agave nectar, chipotle paste, balsamic vinegar (sulphites), water, sea salt, cashews (nuts), organic cultured soy yoghurt (soy), fresh lemon juice, garlic powder, extra virgin olive oil, rapeseed oil, ancho chiles, guajillo chiles, roastedpeanuts,sesameseeds, apple cider vinegar (sulphites), corn tortillas (yellow corn flour), baby gem lettuce, lime, avocadoFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 753.0,
      "protein_g": 21.3,
      "fat_g": 48.4,
      "carbs_g": 64.9,
      "fibre_g": 19.4,
      "salt_g": 1.5
    }
  },
  {
    "id": "mushroom-birria-tacos-with-melted-vegan-mozzarella-onion-salsa-rich-dipping-consomme",
    "title": "Mushroom Birria Tacos With Melted Vegan Mozzarella, Onion Salsa & Rich Dipping Consommé",
    "source_url": "https://planthood.co.uk/products/mushroom-birria-tacos-with-melted-vegan-mozzarella-onion-salsa-rich-dipping-consomme",
    "week_label": null,
    "category": null,
    "ingredients": [],
    "method": "Mushroom Birria Tacos With Melted Vegan Mozzarella, Onion Salsa & Rich Dipping ConsomméMeaty oyster mushrooms, shredded and marinated, then stuffed into warm freshly made corn tortillas with melty vegan mozzarella, fried and served with a fresh onion, coriander and lime salsa, and a side of deliciously rich, slow-cooked consommé infused with three types of Mexican chillies.Prep timeTotal timeCooking Mode:\nCooking instructionsMeaty oyster mushrooms, shredded and marinated, then stuffed into warm freshly made corn tortillas with melty vegan mozzarella, fried and served with a fresh onion, coriander and lime salsa, and a side of deliciously rich, slow-cooked consommé infused with three types of Mexican chillies.NutritionCalories 543kcal; Protein 19.3g; Fat 19.2g; Saturated Fat 12.5g; Total Carbs 91.2g; Fibre 14.9g; Salt 1.2gIngredientsOyster mushrooms, yellow corn tacos (water, yellow corn flour, sea salt), white onion, coriander, lime, tomato puree, vegan bouillon (celery), garlic, red onion, chipotle chillies, chilli de arbol, guajillo chilli, cloves, cumin, oregano, cinnamon, allspice, bay leaf,vegan mozzarella (organicsoyamilk, coconut oil, sea salt, nutritional yeast, tapioca flour, carageenan, lactic acid)AllergensFor allergens, please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories543kcalTotal fat19.2gSaturated fat12.5gSalt1.2gTotal carbohydrate91.2gTotal sugarFibre14.9gProtein19.3gIngredients / AllergensOyster mushrooms, yellow corn tacos (water, yellow corn flour, sea salt), white onion, coriander, lime, tomato puree, vegan bouillon (celery), garlic, red onion, chipotle chillies, chilli de arbol, guajillo chilli, cloves, cumin, oregano, cinnamon, allspice, bay leaf,vegan mozzarella (organicsoyamilk, coconut oil, sea salt, nutritional yeast, tapioca flour, carageenan, lactic acid)AllergensFor allergens, please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 543.0,
      "protein_g": 19.3,
      "fat_g": 19.2,
      "carbs_g": 91.2,
      "fibre_g": 14.9,
      "salt_g": 1.2
    }
  },
  {
    "id": "miso-kimchi-farro-bowl",
    "title": "Kimchi Miso Nourish Bowl With Farro, Charred Purple Sprouting Broccoli & Pak Choi",
    "source_url": "https://planthood.co.uk/products/miso-kimchi-farro-bowl",
    "week_label": null,
    "category": "Nourish",
    "ingredients": [],
    "method": "Kimchi Miso Nourish Bowl With Farro, Charred Purple Sprouting Broccoli & Pak ChoiA delicious and aromatic fried rice dish, with a few healthy swaps including farro grains, which are high in gut-loving fibre! Protein-packed purple sprouting broccoli, pak choi and peas are cooked until tender, then tossed through nutty brown rice grains, along with tangy chopped kimchi and an umami-rich miso dressing. All freshened up with sliced spring onion and red chilli.Prep timeTotal timeCooking Mode:\nCooking instructionsA delicious and aromatic fried rice dish, with a few healthy swaps including farro grains, which are high in gut-loving fibre! Protein-packed purple sprouting broccoli, pak choi and peas are cooked until tender, then tossed through nutty brown rice grains, along with tangy chopped kimchi and an umami-rich miso dressing. All freshened up with sliced spring onion and red chilli.NutritionCalories 586kcal; Protein 31.8g; Fat 10.5g; Saturated Fat 1.2g; Total Carbs 95.2g; Fibre 25.5g; Salt 2.5gIngredientsVegan kimchi (chinese leaf, daikon, carrot, spring onion, apple, green chilli,tamarisoysauce, ginger, chilli powder, garlic, salt), farro (wheat),pak choi, purple sprouting broccoli, peas, red chilli, spring onions,miso (water, organicsoybeans, oranic rice, salt, yeast, koji culture),sesameoilAllergensFor allergens, please see ingredients in boldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories586kcalTotal fat10.5gSaturated fat1.2gSalt2.5gTotal carbohydrate95.2gTotal sugarFibre25.5gProtein31.8gIngredients / AllergensVegan kimchi (chinese leaf, daikon, carrot, spring onion, apple, green chilli, tamarisoysauce, ginger, chilli powder, garlic, salt), farro (wheat), pak choi, purple sprouting broccoli, peas, red chilli, spring onions, miso (water, organicsoybeans, oranic rice, salt, yeast, koji culture),sesameoilAllergensFor allergens, please see ingredients in boldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 586.0,
      "protein_g": 31.8,
      "fat_g": 10.5,
      "carbs_g": 95.2,
      "fibre_g": 25.5,
      "salt_g": 2.5
    }
  },
  {
    "id": "smokey-shakshuka-with-whipped-tahini-dukkah-soft-garlic-flatbread",
    "title": "Sweet & Smoky Butter Bean Shakshuka With Whipped Tahini, Toasted Dukkah & Soft Garlic Flatbread",
    "source_url": "https://planthood.co.uk/products/smokey-shakshuka-with-whipped-tahini-dukkah-soft-garlic-flatbread",
    "week_label": null,
    "category": null,
    "ingredients": [],
    "method": "Sweet & Smoky Butter Bean Shakshuka With Whipped Tahini, Toasted Dukkah & Soft Garlic FlatbreadA sweet and smoky plum tomato sauce, cooked slowly with garlic, red peppers, paprika and rose harissa, then tossed through tender protein-packed butter beans. Finished with a generous drizzle of silky whipped tahini, toasted almond and walnut dukkah and a scattering of fresh parsley. Served with pillowy soft garlic and herb flatbread to scoop up all those delicious flavours.Prep time2Total time10Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1All you need for this dish is two large frying pans. De-stem theredpepperand cut into 1cm slices.STEP 2Place your large frying pan over a medium-high heat and add a drizzle of oil. Once hot, add the slicedpeppersand fry until lightly charred on the outside and starting to go tender. Reduce the heat to medium and add theshakshukasaucealong with the tin of drainedbutter beans. Cook for 4-5 minutes or until piping hot, adding water as needed if it reduces too much or starts to stick.STEP 3Warm theflatbreadsby dry frying (without oil) in your other frying pan on both sides for 30-60 seconds or until lightly toasted. You can alternatively bake or grill them in the oven until warmed through.STEP 4Pick theparsleyleaves, then finely chop.STEP 5To serve up, divide theshakshukabetween serving bowls, drizzle over thewhippedtahini, and scatter over thedukkahand freshparsley. Use your warmflatbreadto scoop up all those delicious flavours. Enjoy!What’s in your boxShakshuka SauceFlatbreadsWhipped TahiniDukkahRed PepperParsleyButterbeansNutritional infoAll nutritional values are based on a per person scale.Calories649kcalTotal fat27gSaturated fat2.3gSalt1.25gTotal carbohydrate80.6gTotal sugarFibre15.4gProtein26.8gIngredients / AllergensOnion, garlic, red pepper, smoked paprika, plum tomatoes, red wine vinegar, raw organic agave nectar, butter beans, tahini (sesame), organic silken tofu (soy, nigari), lemon, nutritional yeast, parsley,almonds,walnuts, sunflower seeds, ground coriander, ground cumin, chilli flakes, salt, flatbread (wheat flour (gluten), salt, water, garlic, dried herbs)For allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 649.0,
      "protein_g": 26.8,
      "fat_g": 27.0,
      "carbs_g": 80.6,
      "fibre_g": 15.4,
      "salt_g": 1.25
    }
  },
  {
    "id": "curried-squash-udon-noodle-soup-with-crispy-coconut-chickpeas-green-kale",
    "title": "Curried Squash Noodle Soup With Rice Noodles, Crispy Coconut Chickpeas & Fresh Green Kale",
    "source_url": "https://planthood.co.uk/products/curried-squash-udon-noodle-soup-with-crispy-coconut-chickpeas-green-kale",
    "week_label": null,
    "category": null,
    "ingredients": [],
    "method": "Curried Squash Noodle Soup With Rice Noodles, Crispy Coconut Chickpeas & Fresh Green KalePrep timeTotal timeCooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.CaloriesTotal fatSaturated fatSaltTotal carbohydrateTotal sugarFibreProteinIngredients / Allergens",
    "nutrition": {}
  },
  {
    "id": "sticky-teriyaki-tofu-bowl-with-purple-sprouting-broccoli-pickled-cabbage-over-sushi-rice",
    "title": "Sticky Teriyaki Tofu Bowl With Purple Sprouting Broccoli & Pickled Cabbage Over Sushi Rice",
    "source_url": "https://planthood.co.uk/products/sticky-teriyaki-tofu-bowl-with-purple-sprouting-broccoli-pickled-cabbage-over-sushi-rice",
    "week_label": null,
    "category": "Feast",
    "ingredients": [],
    "method": "Sticky Teriyaki Tofu Bowl With Purple Sprouting Broccoli & Pickled Cabbage Over Sushi RiceThis crispy, chicken-like tofu dish is packed with flavour, protein and is a great source of vitamins C and K. Tossed through our home made teriyaki sauce made from scratch in our kitchen with all natural ingredients like ginger, soy, mirin and agave. Served alongside tangy pickled red cabbage, a side of charred purple sprouting broccoli and finished with fresh spring onions for the ultimate feast.Prep time2Total time15Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Boil your kettle, then take out two frying pans and a saucepan. Shake theteriyakisaucepouch well before using, in case any of the cornflour has separated from the dressing while chilled.STEP 2Place thesushi ricein a small saucepan and pour over 2.5x its volume in water from your kettle. Bring to the boil and once it's bubbling, reduce the heat to low, cover and cook for 8-10 minutes or until tender but al dente.STEP 3Tear thetofuinto bite-sized chunks with your hands and heat a drizzle of oil in each of your two frying pans over a medium heat.STEP 4Add thetofuto one of your frying pans and fry until golden and crispy on all sides, around 10 minutes. Remove from the pan and set aside. Add theteriyakisauceto the pan and cook until the sauce has thickened a little (1-2 minutes), then take the pan off the heat, add the crispy tofu back into the pan and stir it through the sauce until well coated.STEP 5Meanwhile add thebroccolito your other pan and fry on all sides until tender but al dente. Season to taste with salt and pepper. Finely slice thespring onionwhile everything cooks. You can chop the broccoli up into bite-sized pieces before serving if you prefer.STEP 6Divide thesushi rice,purple sprouting broccoliandpickled cabbagebetween serving bowls. Top with theteriyakitofu, spoon over any extra sauce, then sprinkle over theslicedspringonionandsesameseedsto garnish. Enjoy!What’s in your boxTeriyaki SauceOrganic TofuPickled Red CabbageBroccoli (Purple Sprouting / Tenderstem)Sushi RiceSpring OnionsSesame GarnishNutritional infoAll nutritional values are based on a per person scale.Calories580kcalTotal fat13.4gSaturated fat1.5gSalt2gTotal carbohydrate41.5gTotal sugarFibre5.3gProtein24.7gIngredients / AllergensTenderstem broccoli, spring onion, sushi rice, whitesesameseeds, blacksesameseeds, garlic, ginger, gluten free reduced sodiumsoysauce, raw organic agave nectar, mirin, cornflour,sesameoil, red cabbage, rice vinegar, raw organic cane sugar, salt, tofu (soybeans, water, nigari), saltFor allergens, see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 580.0,
      "protein_g": 24.7,
      "fat_g": 13.4,
      "carbs_g": 41.5,
      "fibre_g": 5.3,
      "salt_g": 2.0
    }
  },
  {
    "id": "crispy-courgette-sweetcorn-fritters-with-garlic-dill-yoghurt-and-sweet-cucumber-pickle",
    "title": "Crispy Courgette & Sweetcorn Fritters With Garlic & Dill Yoghurt and Sweet Cucumber Pickle",
    "source_url": "https://planthood.co.uk/products/crispy-courgette-sweetcorn-fritters-with-garlic-dill-yoghurt-and-sweet-cucumber-pickle",
    "week_label": null,
    "category": null,
    "ingredients": [],
    "method": "Crispy Courgette & Sweetcorn Fritters With Garlic & Dill Yoghurt and Sweet Cucumber PickleCrispy on the outside and full of flavour on the inside, these delicious fritters are packed with big juicy corn kernels, courgettes and lots of spice. All topped with sweet cucumber pickle, a lip smacking garlic and dill yoghurt and a squeeze of fresh lemon to brighten up all the flavours.Prep timeTotal timeCooking Mode:\nCooking instructionsCrispy on the outside and full of flavour on the inside, these delicious fritters are packed with big juicy corn kernels, courgettes and lots of spice. All topped with sweet cucumber pickle, a lip smacking garlic and dill yoghurt and a squeeze of fresh lemon to brighten up all the flavours.NutritionCalories 484kcal; Protein 19.3g; Fat 4.7g; Saturated Fat 1.1g; Total Carbs 101.1g; Fibre 12g; Salt 0.5gIngredientsCourgette, sweetcorn, spring onions, gluten free flour, sweet smoked paprika, ground garlic, chilli flakes, baking powder, brownmustardseeds, cucumber, rice vinegar, raw natural cane sugar, sea salt, water, lemon,soyyoghurt (soya beans, water, selected live cultures (bifidus, acidophilus)), pectin, minerals (calcium carbonate, calcium phosphate, potassium iodide), dill, sea salt, vitamins (D2, B12)AllergensFor allergens, please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories484kcalTotal fat4.7gSaturated fat1.1gSalt0.5gTotal carbohydrate101.1gTotal sugarFibre12gProtein19.3gIngredients / AllergensCourgette, sweetcorn, spring onions, gluten free flour, sweet smoked paprika, ground garlic, chilli flakes, baking powder, brownmustardseeds, cucumber, rice vinegar, raw natural cane sugar, sea salt, water, lemon,soyyoghurt (soya beans, water, selected live cultures (bifidus, acidophilus)), pectin, minerals (calcium carbonate, calcium phosphate, potassium iodide), dill, sea salt, vitamins (D2, B12)AllergensFor allergens, please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 484.0,
      "protein_g": 19.3,
      "fat_g": 4.7,
      "carbs_g": 101.1,
      "fibre_g": 12.0,
      "salt_g": 0.5
    }
  },
  {
    "id": "mushroom-shawarma",
    "title": "Crispy Mushroom Shawarma With Garlic Tahini Sauce, Pickled Radish & Fresh Mint In Soft Flatbread",
    "source_url": "https://planthood.co.uk/products/mushroom-shawarma",
    "week_label": null,
    "category": null,
    "ingredients": [],
    "method": "Crispy Mushroom Shawarma With Garlic Tahini Sauce, Pickled Radish & Fresh Mint In Soft FlatbreadOur most popular dish! Meaty portobello mushrooms are tossed in a shawarma marinade of cumin, allspice, pomegranate molasses and preserved lemon, roasted until crispy, then smothered in garlic tahini sauce, pickled radishes and fresh mint. All wrapped up in freshly baked, pillowy soft flatbread.Prep time1Total time15Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Preheat your oven to 220°C / 200°C fan and take out a large roasting tray.STEP 2Slice theportobellomushrooms0.5cm thick.STEP 3Place theportobellomushroomsinto your roasting tray, pour over themushroommarinade, a generous drizzle of olive oil, some salt and pepper and give everything a good mix with your hands until the they are all thoroughly coated. Roast in the oven for 15 minutes or until tender.STEP 4Once theportobellomushroomsare ready, remove from the oven and place the flatbread(s) directly onto a shelf in your oven to warm through, around 1 minute. Be careful not to overcook as if they’re too crispy they won’t roll up well!STEP 5Lay out your warmflatbreads, spread a layer oftahinidressingover the bottom, pile on themushroomshawarma,radish pickleand finish with somejalapeño mint salsa(very spicy!). Wrap them up and get stuck in!What’s in your boxTahini DressingRadish PickleGarlic & Herb FlatbreadMushroom MarinadePortobello MushroomsJalapeno Mint SalsaNutritional infoAll nutritional values are based on a per person scale.Calories648kcalTotal fat27.5gSaturated fat3.1gSalt0.2gTotal carbohydrate81.7gTotal sugar13.6Fibre9.4gProtein19gIngredients / AllergensPortobello mushroom, radish, red wine vinegar, water, raw organic cane sugar, sea salt, garlic, allspice, cumin, smoked sweet paprika, rapeseed oil, pomegranate molasses, preserved lemon, fresh lemon juice, tahini (sesame), apple cider vinegar (sulphites), raw organic agave nectar, black pepper, mint, jalapeño pepper, extra virgin olive oil, garlic & herb flatbread (wheat flour (gluten), water, salt, yeast, vegetable oil, garlic, parsley, coriander)For allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 648.0,
      "protein_g": 19.0,
      "fat_g": 27.5,
      "carbs_g": 81.7,
      "fibre_g": 9.4,
      "salt_g": 0.2
    }
  },
  {
    "id": "nourishing-sushi-bowl-with-coconut-sesame-crusted-tofu-gochujang-peanut-sauce",
    "title": "Sushi Bowl With Coconut Sesame Crusted Tofu, Edamame, Avocado & Gochujang Peanut Sauce",
    "source_url": "https://planthood.co.uk/products/nourishing-sushi-bowl-with-coconut-sesame-crusted-tofu-gochujang-peanut-sauce",
    "week_label": null,
    "category": null,
    "ingredients": [],
    "method": "Sushi Bowl With Coconut Sesame Crusted Tofu, Edamame, Avocado & Gochujang Peanut SauceThis sushi bowl is packed with protein from the tofu and edamame, flavour from the gochujang peanut sauce and plenty of fresh, light and crunchy textures. The tofu is coated with a coconut, sesame and panko crust which is the perfect topping for sushi rice next to the creamy avocado and crunchy carrot.Prep time8Total time15Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Boil your kettle, then take out a frying pan and a saucepan that you have a lid for (if you have a steamer for it too, even better!).STEP 2Add thesushiriceto your saucepan and cover with 2x its volume in boiling water from your kettle. Bring to the boil, then simmer on low heat with the lid on until the water has been absorbed and the rice is tender but al dente, around 8-10 minutes. Place your steamer over the top for the final 2-3 minutes to steam theedamamebeans. If you don't have a steamer, you can add theedamamein with the rice for 2-3 minutes instead.STEP 3Use a peeler to peel thecarrotsinto ribbons. You could also grate the carrot on the biggest side of a box grater if you prefer. Dress it with a little olive oil, salt and pepper.STEP 4Heat a drizzle of oil in your frying pan and add thesesamecoconutmix. Stir often and fry on a medium low heat for a few mins until toasted and golden. Season to taste with salt and pepper, then place into a small bowl. Meanwhile, slice thetofuinto 6 thin slices. Wipe the frying pan clean, add a drizzle of fresh oil and fry the tofu until just crispy on both sides, for about 2-3 mins.STEP 5When thetofuis cooked, spread a thin layer of thegochujangpeanutsauceonto one side of the tofu and press it into thesesamecoconutmixto create a crust on one side. Repeat with the remainingtofu. Save any remaining crumb for topping.STEP 6Cut theavocadoin half and scoop it out of the skin with a spoon. Slice into thin slices.STEP 7To serve, plate up therice,edamame,carrot,avocadoand crispytofuinto two bowls. Drizzle over thesauceand the remaining coconutsesame coconut mix.What’s in your boxGochujang Peanut SauceSesame Coconut MixOrganic TofuEdamameSushi RiceCarrotCorianderAvocadoNutritional infoAll nutritional values are based on a per person scale.Calories847Total fat41.9gSaturated fat10.5gSalt1.4gTotal carbohydrate97.9gTotal sugarFibre15gProtein30.6Ingredients / AllergensIngredients / AllergensPeanutbutter, gluten freesoysauce, roastedsesameoil , gochujang (tapioca, brown rice, red pepper powder, salt, alcohol,soybeans, garlic, onion), raw organic agave nectar, ginger, garlic, rice vinegar, water, carrot, panko breadcrumbs (gluten), desiccated coconut,sesameseeds, sushi rice, avocado, tofu (soybeans, nigari), edamame (soy), fresh corianderFor allergens please see ingredients in boldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "fat_g": 41.9,
      "carbs_g": 97.9,
      "fibre_g": 15.0,
      "salt_g": 1.4
    }
  },
  {
    "id": "vietnamese-inspired-salad-with-sweet-chilli-dressing-crispy-tofu-rainbow-vegetables",
    "title": "Sweet Chilli Noodle Salad With Crispy Tofu, Julienned Vegetables & Baby Gem",
    "source_url": "https://planthood.co.uk/products/vietnamese-inspired-salad-with-sweet-chilli-dressing-crispy-tofu-rainbow-vegetables",
    "week_label": null,
    "category": null,
    "ingredients": [],
    "method": "Sweet Chilli Noodle Salad With Crispy Tofu, Julienned Vegetables & Baby GemHealth and flavour collide in this fresh and vibrant rice noodle salad that's high in protein and fibre and low in carbs. Crispy golden tofu is tossed through tender rice noodles and lots of fresh colourful crunchy vegetables, all drenched in a sticky, tangy, fiery (all natural!) sweet chilli dressing.Prep timeTotal timeCooking Mode:\nCooking instructionsHealth and flavour collide in this fresh and vibrant rice noodle salad that's high in protein and fibre and low in carbs. Crispy golden tofu is tossed through tender rice noodles and lots of fresh colourful crunchy vegetables, all drenched in a sticky, tangy, fiery (all natural!) sweet chilli dressing.NutritionCalories 445kcal; Protein 25.6g; Fat 12.8g; Saturated Fat 1.9g; Carbs 44.5g; Fibre 9.9g; Salt 0.25gIngredientsBaby gem lettuce, rice noodles (mung bean, water), red cabbage, carrot, cucumber, coriander, tofu (water,soyabeans, nigari), red chillies, garlic, rice vinegar, agave, water, cornstarchAllergensFor allergens see ingredients inbold.Please be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories445kcalTotal fat12.8gSaturated fat1.9gSalt0.25gTotal carbohydrate44.5gTotal sugarFibre9.9gProtein25.6gIngredients / AllergensBaby gem lettuce, rice noodles (mung bean, water), red cabbage, carrot, cucumber, coriander, tofu (water,soyabeans, nigari), red chillies, garlic, rice vinegar, agave, water, cornstarchAllergensFor allergens see ingredients inbold.Please be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 445.0,
      "protein_g": 25.6,
      "fat_g": 12.8,
      "carbs_g": 44.5,
      "fibre_g": 9.9,
      "salt_g": 0.25
    }
  },
  {
    "id": "rich-luxurious-black-daal-makhani-with-crispy-bombay-potatoes-coconut-yoghurt",
    "title": "Rich & Luxurious Black Daal Makhani With Pickled Red Onion, Coconut Yoghurt & Garlic Naan",
    "source_url": "https://planthood.co.uk/products/rich-luxurious-black-daal-makhani-with-crispy-bombay-potatoes-coconut-yoghurt",
    "week_label": null,
    "category": null,
    "ingredients": [],
    "method": "Rich & Luxurious Black Daal Makhani With Pickled Red Onion, Coconut Yoghurt & Garlic NaanCreamy daal makhani is one of India's most special and popular daals. Tender black lentils and plump kidney beans are cooked slowly in coconut milk with curry leaves, black cardamom and star anise for a unique flavour. Served with Indian pickled red onion, cooling coconut yoghurt and soft garlic naan for mopping up all those delicious flavours.Prep timeTotal timeCooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Drain the lentils and take out a large saucepan. Pour theblackdaal makhani sauceinto your large saucepan along with the drainedblacklentils. Place over a medium heat and cook until piping hot, around 4-5 minutes. Stir occasionally while cooking, adding a splash of water as needed if it starts to stick. Season with salt to taste.STEP 2Warm thenaanin a dry frying pan for 30 seconds on each side.STEP 3Roughly chop thecorianderleaves.STEP 4To serve up, divide thedaalbetween serving bowls, top with a dollop ofcoconutyoghurt, somepickledredonionand a scattering of freshcoriander. Enjoy!What’s in your boxBlack Daal Makhani SaucGarlic NaanCoconut YoghurtRed Onion PickleCorianderBlack LentilsNutritional infoAll nutritional values are based on a per person scale.Calories705kcalTotal fat27.8gSaturated fat22.7gSalt0.5gTotal carbohydrate98.3gTotal sugarFibre23.8gProtein24.6gIngredients / AllergensBlack lentils, cumin seeds, coriander seeds, fenugreek, star anise, cardamom, cinnamon, chilli flakes, smoked paprika, clove powder, ginger, brownmustardseeds, chopped tomatoes, tomato puree, coconut milk, water, diced onion, garlic, green chilli, turmeric, creamed coconut, garam masala (coriander, cinnamon, cloves, ginger, star anise, cumin, chilli, fennel, black pepper, bay leaves, sunflower oil, nutmeg, cardamom), liquid smoke, kidney beans, lime, organic bouillon (rice flour, onion powder, carrot powder, turmeric, white pepper, sunflower oil, parsley), garlic naan (wheat (gluten), water, vegetable oil, garlic, herbs), coconut yoghurt (coconut milk  (coconut extract, coconut water, water), coconut water (23%), cornflour, potato starch, stabilizer (pectin*), non-dairy cultures (s. thermophilus + l. bulgaricus, lactobacillus acidophilus, bifidobacterium lactis), coriander, red onion, red wine vinegar, raw natural cane sugar, sea saltFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 705.0,
      "protein_g": 24.6,
      "fat_g": 27.8,
      "carbs_g": 98.3,
      "fibre_g": 23.8,
      "salt_g": 0.5
    }
  },
  {
    "id": "slow-cooked-mushroom-bourguignon-over-creamy-mash-with-green-kale",
    "title": "Slow-Cooked Mushroom Bourguignon Over Creamy Mash With Green Kale",
    "source_url": "https://planthood.co.uk/products/slow-cooked-mushroom-bourguignon-over-creamy-mash-with-green-kale",
    "week_label": null,
    "category": null,
    "ingredients": [],
    "method": "Slow-Cooked Mushroom Bourguignon Over Creamy Mash With Green KaleDeliciously caramelised chestnut mushrooms, slowly cooked with sweet caramelised red onions and soft juicy carrots, in a rich and luxurious porcini and red wine sauce. Served with creamy mash and a side of nutrient-rich wilted green kale.Prep timeTotal timeCooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Boil your kettle, then take out two saucepans and a frying pan.STEP 2Fill both of your saucepans with boiling water from your kettle, then place over a medium heat. Peel thepotatoes, then cut into 2cm cubes. Salt your boiling water, then add thepotatoesto the water and cook for around 10-12 minutes or until the potato is very soft. It should virtually crumble when you jab it with a fork. Place thekalein your other saucepan and boil for 5-10 minutes or until al dente. If you have a steamer you can steam the kale instead.STEP 3Place your frying pan over a medium heat and add a drizzle of oil. While it heats up, slice half of thechestnutmushroomsand cut the other half into quarters to add texture. Fry the mushrooms until golden and caramelised, around 10 minutes, then add thebourguignonsauceand cook for a further 2-3 minutes or until piping hot. Add water as needed if the sauce reduces too much or starts to stick. Season with salt and pepper to taste before serving.STEP 4Once thepotatoesare cooked, add a generous drizzle of extra virgin olive oil, then mash until smooth and creamy. You could also add a little plant milk or butter to make it even creamier (optional). Season well with salt and black pepper to taste.STEP 5To serve up, divide themashbetween serving bowls, ladle over themushroombourguignonand serve alongside thekale. Enjoy!What’s in your boxBourguignon SauceChestnut MushroomsGreen KalePotatoesNutritional infoAll nutritional values are based on a per person scale.Calories430kcalTotal fat1.7gSaturated fat0.3gSalt0.7gTotal carbohydrate82gTotal sugarFibre14.5gProtein14.1gIngredients / AllergensChestnut mushroom, kale, red onion, garlic, thyme, carrot, red wine (sulphites), tomato puree, raw organic agave nectar, balsamic vinegar (sulphites), dried porcini mushrooms, salt, garlic powder, black pepper, gluten free reduced sodiumsoysauce, potatoFor allergens, please see ingredients in﻿boldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 430.0,
      "protein_g": 14.1,
      "fat_g": 1.7,
      "carbs_g": 82.0,
      "fibre_g": 14.5,
      "salt_g": 0.7
    }
  },
  {
    "id": "freshly-made-cavatelli-with-spicy-pumpkin-vegan-nduja-sauce",
    "title": "Freshly Made Tagliolini With Creamy Garlic & Mushroom Sauce & Fresh Parsley",
    "source_url": "https://planthood.co.uk/products/freshly-made-cavatelli-with-spicy-pumpkin-vegan-nduja-sauce",
    "week_label": null,
    "category": null,
    "ingredients": [],
    "method": "Freshly Made Tagliolini With Creamy Garlic & Mushroom Sauce & Fresh ParsleyRich and creamy, bold and unforgettable, our garlicky cashew mushroom sauce will be your next obsession. Tossed through freshly made scialatielli pasta and topped with fresh parsley, every mouthful will leave you wanting more!Prep timeTotal timeCooking Mode:\nCooking instructionsRich and creamy, bold and unforgettable, our garlicky cashew mushroom sauce will be your next obsession. Tossed through freshly made scialatielli pasta and topped with fresh parsley, every mouthful will leave you wanting more!NutritionCalories 694kcal; Protein 33.3g; Fat 18.5g; Saturated Fat 18.5g; Total Carbs 121.6g; Fibre 3.2g; Salt 1.5gIngredientsFresh scialiatielli (durumwheat, flour, water, rice flour), chestnut mushrooms,cashews,soymilk, gluten freesoysauce, onion, garlic, lemon juice, vegan boullion (celery), black pepper, garlic powder, parsleyAllergensNuts, soy, celery, wheatPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITESWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.Calories694kcalTotal fat18.5gSaturated fat18.5gSalt1.5gTotal carbohydrate121.6gTotal sugarFibre3.2gProtein33.3gIngredients / AllergensFresh scialiatielli (durumwheat, flour, water, rice flour), chestnut mushrooms,cashews,soymilk, gluten freesoysauce, onion, garlic, lemon juice, vegan boullion (celery), black pepper, garlic powder, parsleyAllergensNuts, soy, celery, wheatPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 694.0,
      "protein_g": 33.3,
      "fat_g": 18.5,
      "carbs_g": 121.6,
      "fibre_g": 3.2,
      "salt_g": 1.5
    }
  },
  {
    "id": "sun-dried-tomato-lasagne-soup-with-spinach-cannellini-beans-cheesy-cashew-cream",
    "title": "Sun Dried Tomato Lasagne Soup With Spinach, Cannellini Beans & Cheesy Cashew Cream",
    "source_url": "https://planthood.co.uk/products/sun-dried-tomato-lasagne-soup-with-spinach-cannellini-beans-cheesy-cashew-cream",
    "week_label": null,
    "category": null,
    "ingredients": [],
    "method": "Sun Dried Tomato Lasagne Soup With Spinach, Cannellini Beans & Cheesy Cashew CreamPrep timeTotal timeCooking Mode:\nCooking instructionsWhat’s in your boxNutritional infoAll nutritional values are based on a per person scale.CaloriesTotal fatSaturated fatSaltTotal carbohydrateTotal sugarFibreProteinIngredients / Allergens",
    "nutrition": {}
  },
  {
    "id": "sticky-black-pepper-tofu",
    "title": "Crispy Black Pepper Tofu With Stir Fried Vegetables, Sticky Coconut Rice, Pak Choi & Sesame Seeds",
    "source_url": "https://planthood.co.uk/products/sticky-black-pepper-tofu",
    "week_label": null,
    "category": null,
    "ingredients": [],
    "method": "Crispy Black Pepper Tofu With Stir Fried Vegetables, Sticky Coconut Rice, Pak Choi & Sesame SeedsOur fiery black pepper tofu is an explosion of flavours and one of our most popular dishes. Crispy tofu is coated in a sticky, fiery sauce made from crushed black peppercorns, shallots, ginger and soy, and served alongside fluffy coconut rice and tender pak choi.Prep time4Total time15Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Take out a saucepan and a wok (recommended) or large frying pan.STEP 2Place thericein your saucepan and cover with 2.5x its volume in water. Bring to the boil, then reduce the heat and cover. Allow to cook for 5 minutes, then stir through thedesiccatedcoconutand continue cooking for a further 3-5 minutes or until tender but al dente.STEP 3Tear thetofuinto bitesized pieces with your hands, then place into a bowl and toss through thecornflouruntil evenly coated. Add a drizzle of a neutral oil (e.g. vegetable, sunflower or groundnut, but not olive oil) to your frying pan or wok and once hot, add the tofu and fry until golden and crunchy on all sides, around 10 minutes. Transfer to a bowl lined with kitchen towel.STEP 4In the meantime, deseed thered pepperand cut it into bite-sized pieces. Peel theonion, trim the top and base, and cut it into bite-sized pieces as well.STEP 5Wipe the pan clean with a kitchen towel, then place it back on a medium-high heat. Once the oil is hot, add the preparedred pepperandonion, and stir-fry until softened and lightly browned. Add theblack pepper sauceand cook until simmering, about 2–3 minutes. Once the sauce is hot, return the tofu to the pan and stir through for 1–2 minutes, then remove from the heat.STEP 6Finely slice thespring onions. Slice the base off thepak choistem and pull apart the leaves with your hands. Place a frying pan over a medium heat and add a drizzle of oil. Once hot, fry the pak choi until tender, around 3-5 minutes. Season to taste with soy or salt.STEP 7Serve theblack pepper tofualongside thecoconutriceand charredpakchoi. Scatter over thespringonionsandsesame seedsto garnish and enjoy!What’s in your boxBlack Pepper SauceOrganic TofuCornstarchPak ChoiJasmine RiceDesiccated CoconutSpring OnionsWhite OnionRed PepperSesame GarnishNutritional infoAll nutritional values are based on a per person scale.Calories764kcalTotal fat22.6gSaturated fat11.2gSalt2.5gTotal carbohydrate124.7gTotal sugar19.4gFibre15.2gProtein31.3gIngredients / AllergensOrganic tofu (soybeans, water, nigari), cornflour, garlic, ginger, gluten freesoysauce, tamari (soy), roastedsesameoil, raw organic agave nectar, black pepper, sichuan peppercorn, white pepper, shiitake mushroom, water, tomato purée, white miso (soybeans, rice, salt), mirin, jasmine rice, red pepper, pak choi, onion, desiccated coconut, spring onion,sesameseedsFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 764.0,
      "protein_g": 31.3,
      "fat_g": 22.6,
      "carbs_g": 124.7,
      "fibre_g": 15.2,
      "salt_g": 2.5
    }
  },
  {
    "id": "crispy-buffalo-tofu-tacos-with-cooling-ranch-dressing-shredded-cabbage-pineapple-salsa",
    "title": "Crispy Buffalo Tofu Tacos With Cooling Ranch Dressing, Shredded Cabbage & Juicy Pineapple",
    "source_url": "https://planthood.co.uk/products/crispy-buffalo-tofu-tacos-with-cooling-ranch-dressing-shredded-cabbage-pineapple-salsa",
    "week_label": null,
    "category": null,
    "ingredients": [],
    "method": "Crispy Buffalo Tofu Tacos With Cooling Ranch Dressing, Shredded Cabbage & Juicy PineappleFreshly baked soft corn tortillas filled with crispy tofu smothered in a zingy buffalo sauce. Finished with cooling cashew ranch dressing, shredded red cabbage, juicy pineapple and fresh coriander. These little handfuls of heaven are filled to the brim with fresh and vibrant flavours.Prep time3Total time15Cooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1All you need to finish this dish is a large frying pan.STEP 2Tear thetofuinto bite-sized chunks with your hands, then place into a small bowl with thecornflourand season well with salt and pepper. Mix carefully with your hands to coat the tofu in the cornflour. Add a drizzle of oil to your frying pan and place over a medium-high heat. Once hot, add the tofu and fry on all sides until golden and crispy. Alternatively, toss in a little oil and air fry for 15 minutes, tossing every 5 minutes.STEP 3Meanwhile slice thered cabbageas thinly as you can (use a mandolin if you have one). Roughly chop thecoriander. Roughly chop thepineappleinto smaller pieces. Give thecashew ranch saucea shake in its pouch before opening in case it has separated while sitting in the fridge.STEP 4When the tofu is ready, remove it from the pan and place it into a bowl and toss with thebuffalo sauceto coat evenly. You may want to run the sauce pouch under warm water to loosen the texture before opening.STEP 5Wipe your frying pan clean with some kitchen towel, then dry-fry thetacos(without oil) for 10–20 seconds on each side, or until warm and soft. Add a sprinkle of water if you’d like them extra soft.STEP 6Divide the tacos between serving plates, then pile up with the crispybuffalotofu, a drizzle ofcashewranchsauce, theredcabbageandpineapple. Finish with a scattering ofcorianderto garnish and enjoy!What’s in your boxCorn TacosOrganic TofuBuffalo Hot SauceCashew Ranch SaucePineappleCorianderRed CabbageCornflourNutritional infoAll nutritional values are based on a per person scale.Calories453kcalTotal fat17.2gSaturated fat4.6gSalt1.25gTotal carbohydrate48.1gTotal sugar12gFibre7.4gProtein23.4gIngredients / AllergensCorn tortillas (yellow corn flour), cornflour, organic tofu (soybeans, water, nigari), distilled vinegar, aged cayenne red peppers, salt, water, canola oil, paprika, garlic powder, coconut oil, raw organic agave nectar, sea salt, vegan labneh (spring water, cashews (nuts), coconut oil, pink salt, garlic, live culture), cashews (nuts), soy milk (soybeans, water), fresh lemon juice, fresh lime juice, garlic powder, onion powder, black pepper, parsley, pineapple, red cabbage, fresh corianderFor allergens please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, PEANUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 453.0,
      "protein_g": 23.4,
      "fat_g": 17.2,
      "carbs_g": 48.1,
      "fibre_g": 7.4,
      "salt_g": 1.25
    }
  },
  {
    "id": "mac-greens-with-purple-sprouting-broccoli-crispy-kale-mezzi-rigatoni-in-a-creamy-cashew-sauce",
    "title": "Mac & Greens With Tenderstem Broccoli, Crispy Kale & Mezzi Rigatoni In A Creamy Cashew Sauce",
    "source_url": "https://planthood.co.uk/products/mac-greens-with-purple-sprouting-broccoli-crispy-kale-mezzi-rigatoni-in-a-creamy-cashew-sauce",
    "week_label": null,
    "category": null,
    "ingredients": [],
    "method": "Mac & Greens With Tenderstem Broccoli, Crispy Kale & Mezzi Rigatoni In A Creamy Cashew SauceOur plant-based spin on one of the world's greatest comfort foods is exactly what you want to eat at this time of year. It's so delicious and so nutritious at the same time. Made with a creamy, 'cheesy' cashew based sauce, tossed through mezzi rigatoni with lots of vibrant, healthy green vegetables including tenderstem broccoli, garden peas and crispy kale. It's packed with 32g of protein, 22g of fibre and lots of essential vitamins and minerals.Prep timeTotal timeCooking Mode:\nCooking instructionsBefore you start, take out all the ingredients for this recipe (see picture above) and rinse any raw grains, herbs or vegetables.STEP 1Boil your kettle, preheat your oven to 180°C / 160°C fan and take out a large saucepan and a large baking tray.STEP 2Remove any hardy stems from thegreenkaleand then roughly chop the leaves. Cut thebroccoliinto bite-sized pieces, place into your roasting tray, toss in a little olive oil and season well with salt and pepper. Roast for 10 minutes, then add thekalewith a little olive oil and seasoning tossed through and roast everything for a further 5 minutes.STEP 3Meanwhile pour boiling water from your kettle into your other saucepan and place over a high heat. Once boiling add themezzirigatoniand cook until al dente, around 12 minutes. Drain the pasta and set aside to keep warm.STEP 4Place the same saucepan you used for your pasta back over a low-medium heat and pour in thecashew 'cheese' sauce. Heat through for 1-2 minutes, then remove from the heat and stir through the pasta and half of thebroccoliandkale. Divide the pasta between serving bowls and garnish with the remainingbroccoliandkale. Season to taste with salt and pepper, and enjoy!What’s in your boxCashew 'Cheese' Sauce with Garden PeasBroccoliGreen KaleMezzi RigatoniNutritional infoAll nutritional values are based on a per person scale.Calories652kcalTotal fat20.9gSaturated fat3.7gSalt1.3gTotal carbohydrate90.7gTotal sugarFibre9gProtein28.1gIngredients / AllergensIngredients / AllergensTenderstem broccoli, curly kale, rigatoni (durum wheat (gluten)), cashews (nuts), soy milk (soybeans), nutritional yeast, dijonmustard, extra virgin olive oil, white miso (soybeans, rice, salt, yeast, koji culture), fresh lemon juice, garlic, sea salt, black pepper, garden peasFor allergens, please see ingredients inboldPlease be advised that we handle the following allergens in our kitchen: CELERY, SOYA, GLUTEN, NUTS, MUSTARD, SESAME SEEDS, SULPHITES",
    "nutrition": {
      "calories": 652.0,
      "protein_g": 28.1,
      "fat_g": 20.9,
      "carbs_g": 90.7,
      "fibre_g": 9.0,
      "salt_g": 1.3
    }
  }
]